[
  {
    "Name": "Techxcape",
    "Rate": "$50 - $99/hr",
    "Employee": "10 - 49",
    "Founded": "",
    "Website": "https://techxcape.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "A quick look at our services mentioned below: 1. Graphic Design - illustration - logos - website Layouts - Facebook App Layouts - Mobile App Layouts - Corporate Branding 2. Web Design & Development 3. CMS (Content Management System) 4. Mobile Applications Native and Cross Platform 5. Responsive Websites that are optimized for latest search engine trends and standards 6. Digital Marketing."
  },
  {
    "Name": "Code Sappers",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2018,
    "Website": "https://codesappers.com/",
    "location": "Contact information Code Sappers Office # 613 6th floor garden heights plaza, garden town Lahore, Lahore, Punjab 54700 Pakistan 03218868214",
    "CITY": "Lahore",
    "FocusArea": "We are here to develop optimized business softwares to make your business more efficient. Web Development Desktop Application Development Ecommerce Website Development ERP Systems Mobile App Development"
  },
  {
    "Name": "Datalatics",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2016,
    "Website": "https://datalatics.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Machine Learning Text Analytics Big Data Full-Text Search Large Scale Systems Automated Data Scraping Web Development Search Engine Optimization (SEO) Our Skills Amazon Web Services - S3 RDS, EC2, ELB, EMR CloudFront Auto-Scaler DynamoDB CloudSearch Lambda Kinesis Apache Hadoop, Apache Spark, Apache Lucene ElasticSearch PredictionIO Azure Machine Learning, Amazon Machine Learning"
  },
  {
    "Name": "Eziline Software House Pvt Ltd",
    "Rate": "$25 - $49/hr",
    "Employee": "50 - 249",
    "Founded": 2007,
    "Website": "https://eziline.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Mobile Development Website Desgining Ecommerce Store SEO Web Hosting Services"
  },
  {
    "Name": "Innovative designers",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2013,
    "Website": "https://innovative-designer.com/",
    "location": "Contact information Innovative designers qazi strrest, Vancouver, Washington 86000 United States 03145345470 Innovative designers H# 2 Sector D-3, Phase II , KDA, Kohat, Khyber Pakhtunkhwa 26000 Pakistan View more",
    "CITY": "",
    "FocusArea": "CREATIVE WEBSITE DESIGN Award-winning responsive web design, conversion rate optimization, and user experience design LEARN MORE UX & E-COMMERCE Sales measurement and nurturing software with website personalization and custom functions. LEARN MORE SEO Ranking on Search Engines Top Class onpage SEO Services Results with proof!"
  },
  {
    "Name": "Pikes Soft",
    "Rate": "< $25/hr",
    "Employee": "",
    "Founded": 2013,
    "Website": "http://www.pikessoft.com/",
    "location": "Contact information Pikes Soft 22h2 johar town lahore, Lahore, Punjab 54000 Pakistan",
    "CITY": "Lahore",
    "FocusArea": "Services Mobile development Our strong understanding and skill set enables us to deliver business, communication, social networking and entertainment mobile apps for Android and IOS. Our rapid prototyping could assist you to feel your app before its inception. We accommodate your specific needs to build your ideal mobile application across all major platforms. Web Development We are proficient in Ruby on Rails using the best practices of MVC and OOP. We are using Agile methodologies to develop reliable and robust web apps. We love to converting your ideas into reality and fulfilling your Web Services, API Development, and SaaSs requirements. We have one of the most powerful and experience ROR teams who have worked across a variety of business domains. Js Framework At PikesSoft, we believe that frameworks are the future of web design and development. By using frameworks, we are able to reduce time, and in the process, reduce costs for our clients by using frameworks. In this way, we are able to develop extremely complex applications and software in just a fraction of the time it would take were we not using frameworks. Our team of expert coders and developers have years of experience in modern web technologies and research: hands-on experience digging deep into layers of code and utilizing top software programs in order to determine the best processes and methods to develop complex applications in a cost-efficient and timely manner. Some of our most used frameworks can be seen in the picture"
  },
  {
    "Name": "JSdevs",
    "Rate": "< $25/hr",
    "Employee": "",
    "Founded": 2019,
    "Website": "https://jsdevs.dev/",
    "location": "Contact information JSdevs Top Floor, ZS Plaza, Jutial Gilgit, Shahrah-e-Quaid Azam Road, Islamabad, Federal Capital Area 15100 Pakistan 03455927001",
    "CITY": "Islamabad",
    "FocusArea": "JSdevs also offer quick and reliable solutions to custom software and development related issues like bug fixes and feature completions in the form of Gigs. Other services include UI/UX design, graphics design, and digital marketing services. Our talented developers are experts in ReactJS, VueJS, React Native, NextJS, NuxtJS, TypeScript, AngularJS, Redux, Gatsby, ExpressJS, NestJS, MongoDB, Redis, PostgreSQL, MySQL, Laravel, PHP, Wordpress, Magento, Drupal, Docker, Kubernetes, Jenkins, Digital Ocean, AWS, Google Cloud, MERN Stack, MEAN Stack, MEVN Stack, JAM Stack and more. Digital marketing services provided by JSdevs include Search Engine Optimization (SEO), Search Engine Marketing (SEM, PPC) and Content Marketing. JSdevs also offer free consultations on how to choose the right technology stack."
  },
  {
    "Name": "Graphiters",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2016,
    "Website": "http://graphiters.com/",
    "location": "Contact information Graphiters Suite 5C Askari towers 1, Block 1, DHA Phase 2, Islamabad, Islamabad, Federal Capital Area 44000 Pakistan +923345353228",
    "CITY": "Islamabad",
    "FocusArea": "Graphiters offer services such as 1- Web Design & Development 2- App Development 3- Social Media Marketing 4- Graphic design 5- SEO"
  },
  {
    "Name": "harfsol technologies",
    "Rate": "< $25/hr",
    "Employee": "",
    "Founded": 2017,
    "Website": "https://www.harfsol.com/",
    "location": "Contact information harfsol technologies 55/5-b Bank Road Saddar, Rawalpindi, Punjab 46000 Pakistan 00923342023798",
    "CITY": "Rawalpindi",
    "FocusArea": "Web Development Desktop Application Development Android App Development ERP Solution Graphic Designing Web Hosting MOBILE APPS DEVELOPMENTMOBILE APPS DEVELOPMENT"
  },
  {
    "Name": "TBox Solutionz SMC Pvt Ltd",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2014,
    "Website": "http://www.tboxsolutionz.com/",
    "location": "Contact information TBox Solutionz SMC Pvt Ltd Basement Sana Plaza Near Jawad Chema Chowk Baharshah Road Lahore Cantt, Lahore, Punjab 54000 Pakistan",
    "CITY": "Lahore",
    "FocusArea": "We currently provide custom services in (Web) NodeJS, ReactJS, PHP, Wordpress, Shopify, Laravel, Responsive sites, ecommerce solutions and (Mobile) iOS/Android/ReactNative technologies. Using these technologies we have covered domains of fleet services, cargo services, health-care, grocery delivery, video streaming, social network, Automobile Industry(workshops, service shops) and many more."
  },
  {
    "Name": "Intellyct",
    "Rate": "NA",
    "Employee": "",
    "Founded": 2016,
    "Website": "http://intellyct.com/",
    "location": "Contact information Intellyct 9411, Manassas, Virginia 9430 United States Intellyct 1, Lahore, Punjab 548000 Pakistan View more",
    "CITY": "Lahore",
    "FocusArea": "Intellyct offers services in below domain IoT Solution Development. Firmware/Embedded Systems. Machine Learning and Big Data Analytics E-Commerce Platform Development DevOps Mobile Application Development. Web application development"
  },
  {
    "Name": "Solutions Player",
    "Rate": "$100 - $149/hr",
    "Employee": "",
    "Founded": 2000,
    "Website": "https://www.solutionsplayer.com/",
    "location": "Contact information Solutions Player Office No. 4, 2nd Floor, Huzaifa Center, I-8 Markaz, , Islamabad, Federal Capital Area 45710 Pakistan 0092-51-493 8227",
    "CITY": "Islamabad",
    "FocusArea": "Mobile app development, Software Project Management, Web Development, ASP.NET, JavaScript, PHP, Photoshop, .NET, and Dreamweaver, Web Design, Graphic Design"
  },
  {
    "Name": "Relliks Systems",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2010,
    "Website": "https://relliks.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "We Provide Software Development, Mobile apps Development, CMS, CRM and Information System development for your own domain."
  },
  {
    "Name": "Soft Solutions",
    "Rate": "$100 - $149/hr",
    "Employee": "10 - 49",
    "Founded": 2003,
    "Website": "https://softsolutions.com.pk/",
    "location": "",
    "CITY": "",
    "FocusArea": "Mobile app development, Web Designing, Software Development, Outsourcing, and Graphic Designing"
  },
  {
    "Name": "Innovicsoft",
    "Rate": "< $25/hr",
    "Employee": "10 - 49",
    "Founded": "",
    "Website": "http://innovicsoft.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Custom Software Development, Mobile App Development, Enterprise solutions, Dedicated Teams, Blockchain Solutios, OS an Android, Augmented Reality (AR), Internet of Things (IoT), UI/UX Design, Cloud Computing, Big Data and Analytics, Product Design and Engineering, IT Strategy Consulting, Testing and QA, DevOps, and IT Infrastructure Management"
  },
  {
    "Name": "Dynamologic Solutions",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2007,
    "Website": "http://www.dynamologic.com/",
    "location": "Contact information Dynamologic Solutions House 12, E-11/1, Islamabad, Islamabad, Federal Capital Area 44000 Pakistan 051-8312580",
    "CITY": "Islamabad",
    "FocusArea": "Web Design, Web Development, SEO, Mobile App Development, E-Commerce Solutions, Digital Marketing"
  },
  {
    "Name": "API PILOT",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2015,
    "Website": "https://apipilot.com/",
    "location": "Contact information API PILOT M2 Park Avenue, Shahrah-e-Faisal, Karachi, Sindh 75400 Pakistan +923463149752",
    "CITY": "Karachi",
    "FocusArea": "Custom Software Development Website Designing Logo Designing E-commerce development Digital Marketing Services."
  },
  {
    "Name": "Brandpeg",
    "Rate": "< $25/hr",
    "Employee": "",
    "Founded": 2017,
    "Website": "https://www.brandpeg.com/",
    "location": "Contact information Brandpeg 1st Floor Unit 14, Athy Business Campus, Athy, Kildare, Kildare Co. Kildar Ireland +353 (86) 2478160 Brandpeg Brandpeg House, Block-3 Gulshan-e-Iqbal Karachi, Karachi, Sindh 75300 Pakistan +923303160761 View more",
    "CITY": "Karachi",
    "FocusArea": "WEB DESIGNING WEB DEVELOPMENT SEO SERVICES SOCIAL MEDIA MARKETING PAY PER CLICK BRAND MANAGEMENT AND DEVELOPMENT OFFSET PRINTING SERVICES (Pakistan Only)"
  },
  {
    "Name": "InnoTech Solution",
    "Rate": "< $25/hr",
    "Employee": "10 - 49",
    "Founded": 2015,
    "Website": "https://www.innotechsol.co/",
    "location": "",
    "CITY": "",
    "FocusArea": "Our Services: MOBILE APPLICATION DEVELOPMENT IOS App Development Android App Development Hybrid Mobile App Development React Native App Development SOFTWARE PRODUCT DEVELOPMENT Custom Software Development CRM Development Solution POS Development Solution FULL STACK DEVELOPMENT PHP Development Laravel Development Company Codeigniter Development Custom Web Development CMS Web Development WEBSITE OPTIMIZATIONS Search Engine Optimization Search Engine Marketing Pay Per Click Advertising Link Building Services GRAPHIC DESIGNING Branding Social Media Marketing Social Media Page Maintenance Video Animation 2D and 3D Animations"
  },
  {
    "Name": "Novatore Solutions",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2013,
    "Website": "http://novatoresols.com/",
    "location": "Contact information Novatore Solutions 121-C PCSIR Staff, Lahore, Punjab 54000 Pakistan 924234004426 Novatore Solutions 125 Fern Avenue., Ashburn, Virginia United States 13105318682 Novatore Solutions Villa 33-D Ring Road,, Doha, Doha Qatar 97466854189 View more",
    "CITY": "Lahore",
    "FocusArea": "- Website Development - Mobile App Development - E-Commerce Solutions - E-Learning Solutions - Artificial Intelligence - Customized IT solutions You can learn more about our services here: https://novatoresols.com/"
  },
  {
    "Name": "Ignitive Tech",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2018,
    "Website": "https://ignitive-tech.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Mobile Development ( Android app $ IOS app) Website Development ERP/CRM Systems 3D Modeling Graphic Designing Digital Marketing"
  },
  {
    "Name": "Salactsol",
    "Rate": "$50 - $99/hr",
    "Employee": "",
    "Founded": 2011,
    "Website": "http://www.salactsol.com/",
    "location": "Contact information Salactsol Suite# 2, MZ Floor, Maqbool Heights, Nipa Chorangi, Gulshan-e-Iqbal, Karachi, Sindh 74600 Pakistan 92333 3463086",
    "CITY": "Karachi",
    "FocusArea": "iOS App Salactsol specializes in iOS application development which attracts maximum number of iOS users. LEARN MORE Android Apps Salactsol's Android applications provide you a competitive advantage in respective industry. LEARN MORE Cross Platform Our application attracts and retains maximum number of users around the world LEARN MORE Augmented Reality Salactsol's AR application developers lay pieces of real world in virtual world. LEARN MORE React Native Apps Salactsol develops React Native Mobile Apps with smooth and strong performance. LEARN MORE Mobile Games Salactsol enables you to develop Mobile games that take the entertainment to the next level."
  },
  {
    "Name": "Heuristix",
    "Rate": "NA",
    "Employee": "",
    "Founded": 2016,
    "Website": "https://www.heuristix.net/",
    "location": "Contact information Heuristix Office # 411, Subhan Mall, Expo Center Road, H3 Block Johar Town, Lahore, Lahore, Punjab 54770 Pakistan +1 (484) 424-9928 Heuristix Main St, Dundee, IL, Illinois City, Illinois 60118 United States +1 (484) 424-9928 View more",
    "CITY": "Lahore",
    "FocusArea": "Heuristix is a platform that is experienced in offering Web development, designing, Digital marketing, UI/UX designing, mobile app development and other customized web services across the U.S. Get professionally tailored backend and excellent frontend solutions as per your convenience. Heuristix has a broad knowledge of all technical coding details that is required for a great business website."
  },
  {
    "Name": "SOFTWARE HOUSE IN ISLAMABAD",
    "Rate": "< $25/hr",
    "Employee": "2 - 9",
    "Founded": 2016,
    "Website": "http://imseoservices.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Beat the competition in your local area with our Top Ranking SEO Services. We specialize in Google Search Engine Optimisation. Our IM SEO services gurus will work with you to deliver a laser-sharp SEO strategy that produces maximum ROI. How do we know it works? Think about how you found us. Chances are you searched for something like “SEO SERVICES IN ISLAMABAD\", and here you are. Now imagine what we can do for you."
  },
  {
    "Name": "Heuristify",
    "Rate": "NA",
    "Employee": "10 - 49",
    "Founded": 2016,
    "Website": "https://heuristify.io/",
    "location": "",
    "CITY": "",
    "FocusArea": "Mobile App Development (iPhone, Android, iPad, Windows, Blackberry,) Software Development (AngularJS, ReactJS,Node.js, javascript ) Web development Artificial intelligence(machine learning,deep learning)"
  },
  {
    "Name": "Zoob Technologies",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2017,
    "Website": "https://zoobtechnologies.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "ICO Development Cryptocurrency Development Cryptocurrency Exchange Development Blockchain IoT Development POC Development Hyperledger Development Ethereum Development Smart Contract Development"
  },
  {
    "Name": "Oriefy",
    "Rate": "< $25/hr",
    "Employee": "",
    "Founded": 2018,
    "Website": "https://oriefy.com/",
    "location": "Contact information Oriefy 19th Ave New York, NYC, New York 95822 United States +18455 272941 Oriefy 10 Kashgar Road, London, London SE181HW United Kingdom +447366 539598 Oriefy P-128, ST#9 chenab Chowk jhang road faisalabad , Faisalabad, Punjab 38000 Pakistan +923096909030 View more",
    "CITY": "",
    "FocusArea": "Oriefy team serves in logo design, UI & UX design, Infographic design, motion graphics, Web designing and development, Mobile app development, content marketing, Search Engine Optimization (SEO), Social Media Marketing (SMM) and API integration in the digital world. Our team is comprised of fully skilled and professionals experts who can resolve the complex issue of the website and add innovative ideas to your business so you can achieve more than expected profits. feel free and confident to join the Oriefy family to avail services that can help you to grow your business."
  },
  {
    "Name": "Exper Labs",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2013,
    "Website": "https://www.experlabs.com/",
    "location": "Contact information Exper Labs 89B3 Gulber III, Lahore, Punjab 54000 Pakistan +923024448506",
    "CITY": "Lahore",
    "FocusArea": "E Commerce Order Management Systems Order fulfilment systems Conversion and Growth Salesforce Commerce Cloud​​Mobile Apps Development ( iOS & Android ) Web Development"
  },
  {
    "Name": "VirrgoTech",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2018,
    "Website": "https://virrgotech.com/",
    "location": "Contact information VirrgoTech W Chippewa St, Buffalo, New York 14203 United States VirrgoTech G-11, Islamabad, Federal Capital Area Pakistan View more",
    "CITY": "Islamabad",
    "FocusArea": "Branding Web/Application designing Web/Application Development Copywriting Digital Marketing"
  },
  {
    "Name": "Dotklick",
    "Rate": "NA",
    "Employee": "",
    "Founded": 2003,
    "Website": "https://dotklick.com/",
    "location": "Contact information Dotklick Suit # 112,1st Floor, Progressive Center, Main Shahrah-e-Faisal, ، Block 6 PECHS, Karachi, Sindh 75350 Pakistan 02134391107",
    "CITY": "Karachi",
    "FocusArea": "Dotklick provide a bespoke evaluation of your Marketing strategy customized to fulfill business requirements. Don’t miss out a huge business opportunites Branded SMS Website Designing Social Media Marketing Website Development"
  },
  {
    "Name": "Digics Pvt Ltd",
    "Rate": "$50 - $99/hr",
    "Employee": "50 - 249",
    "Founded": 2019,
    "Website": "https://digics.com.pk/",
    "location": "",
    "CITY": "",
    "FocusArea": "Logo Design, Website Design, Website Development, Flyer Design, Brochure Design, Content Writing, Book Writing, Ghostwriting, SEO, digital marketing, Apps Development, Video Animation"
  },
  {
    "Name": "Avaib",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2004,
    "Website": "http://www.avaib.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "OUTSOURCING SOLUTIONS (BPO) START-UPS & DYNAMIC WEBSITES SOFTWARE APPLICATION DEVELOPMENT SEARCH ENGINE OPTIMIZATION (SEO) REMOTE WORK FORCE PROVIDERS"
  },
  {
    "Name": "Five Rivers Technology",
    "Rate": "$25 - $49/hr",
    "Employee": "50 - 249",
    "Founded": 2003,
    "Website": "https://www.fiveriverstech.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "FiveRivers has been at the cutting edge of technology since 2003, pioneering Virtualization and Systems Management technology for Enterprise and Embedded systems, developing globally top ranked mobile applications downloaded tens of millions of times and winning international awards for our work. But for all the trails we’ve blazed, we’ve never been as excited about the future as we are now. The coming Virtual Reality (VR), Artificial Intelligence (AI) and Internet of Things (IoT) revolutions will alter the tech landscape and our own lives in ways we can’t even fully imagine at present. So, while the history of the future still needs to be written and only its contours are visible, what we know for sure is that we won’t just be experiencing tomorrow from the sidelines. We will be rolling up our sleeves and building it!"
  },
  {
    "Name": "Softak Solutions PVT LTD",
    "Rate": "< $25/hr",
    "Employee": "",
    "Founded": 2016,
    "Website": "https://softaksolutions.com/",
    "location": "Contact information Softak Solutions PVT LTD 22, Islamabad, Federal Capital Area 44000 Pakistan 923315578691",
    "CITY": "Islamabad",
    "FocusArea": "What We Do: We are a exciting group of Highly Experienced and Qualified Software Developers and Testers .We AIM of providing best and most cost effective services on cutting edge Technologies here on Up-work. Our Team has exceptional expertise in following domains: • Android app Development. • IOS App Development. • PHP(laravel, WordPress and Codeigniter) Web development. • All Manual Testing Services. • Custom Web applications functional testing. • Woocommerce, Wordpress, Joomla, Opencart and all eCommerce frameworks testing services. • Hybrid App Development (Phone Gap, React Native, IONIC, Electron) • PHP web development in Frameworks like WOO, WordPress , Joomla etc."
  },
  {
    "Name": "InterActive Technologies",
    "Rate": "$100 - $149/hr",
    "Employee": "",
    "Founded": 2007,
    "Website": "http://www.intertech.pk/",
    "location": "Contact information InterActive Technologies Office 21, Second Floor, Big City Tower, Liberty RoundAbout، Block E 2 Gulberg III, Lahore, Punjab 54400 Pakistan 03070724847",
    "CITY": "Lahore",
    "FocusArea": "Mobile App Development, Custom Web Applications, Software Development, Search Engine Optimization, Social Media Marketing ,Corporate Identity"
  },
  {
    "Name": "SkyQuest Interactive",
    "Rate": "NA",
    "Employee": "",
    "Founded": 2015,
    "Website": "https://www.sqinteractive.com/",
    "location": "Contact information SkyQuest Interactive Architects & Engineers Society Ltd, Karachi, Sindh 75290 Pakistan +923312490641 SkyQuest Interactive 328 Virginia Ave, Nashville, Tennessee 37216 United States +1 (629) 444-8930 View more",
    "CITY": "Karachi",
    "FocusArea": "We provide end-to-end digital solutions for your e-commerce and retail business that includes: E-commerce website design & development Digital marketing & strategy (Social Media + E-commerce SEO) Custom application development Branding & creative"
  },
  {
    "Name": "RNS Solutions",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": "",
    "Website": "https://rnssol.com/",
    "location": "Contact information RNS Solutions Al-Rahim Arcade, National Market, Satellite Town, Rawalpindi, Punjab 44000 Pakistan +92-51-8356551 RNS Solutions Hong Lim Complex Singapore View more",
    "CITY": "Rawalpindi",
    "FocusArea": "❖ Enterprise Blockchain Solutions ❖ Software Development ❖ Cyber Security ❖ AI Applications Development ❖ Research Services"
  },
  {
    "Name": "Smart Coders (SMC) Private Limited",
    "Rate": "< $25/hr",
    "Employee": "10 - 49",
    "Founded": 2017,
    "Website": "https://smartcoders.co.uk/",
    "location": "",
    "CITY": "",
    "FocusArea": "Hello there, my name is Umer Khalid. I am the Director and CEO of Smart Coders DMCC Dubai, and Smart Coders Pvt Ltd Pakistan. I am contacting your company to ask you about any Software related projects you want to outsource. We at Smart Coders Private Limited will provide you the complete solution to your Software Requirement. We have Android, iOS and Web Teams. We will give you regular progress and 24/7 access to office cameras. Our developers have more than 4 years of experience in their respective fields. Our Company will provide all copyrights and NDAs required by the client and we are flexible in offering maintenance to our clients, thus the clients can always expect after sales service from us. We at Smart Coders are determined to satisfy our clients requirements and expectations. And we take all necessary measures to do so. If you have any software projects in mind, you can give me a call or whatsapp or email me or skype: +92 346 2740428 Email: ceo@smartcoders.co.uk Skype: umer.khalid677"
  },
  {
    "Name": "Coding Pro",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2017,
    "Website": "https://codingpro.com.pk/",
    "location": "",
    "CITY": "",
    "FocusArea": "Coding Pro - Pakistan is specialized in: Web Design & Development Social Media Marketing Financial Solutions Graphic Designing Mobile Application Development Machine Learning AR Development VR Development Games Development Internet of Things Coding Pro - Pakistan also provides Australian certified IT short courses Introduction to Programming Android Development Web Design & Development Games Development Machine Learning Graphics Designing"
  },
  {
    "Name": "Imroz",
    "Rate": "NA",
    "Employee": "",
    "Founded": 2016,
    "Website": "https://imroz.io/",
    "location": "Contact information Imroz 2-D Birdwood Road, Lahore, Punjab 54000 Pakistan +92 42 37500473 Imroz 120 High Road, East Finchley, London, London N2 9ED United Kingdom +44 20 30340478 View more",
    "CITY": "Lahore",
    "FocusArea": "1. Product & Digital Strategy Whether you want to explore the power of digital to transform your business and customer experiences; or want to bring a new product to the world, you will need a plan. We help you analyse both the internal and external landscape and devise a strategy. - Digital Transformation: We help businesses integrate technology with their people and processes; transform existing business practices to support better end-user experiences, drive decisions through data and bring more visibility in operations. - Product Roadmap: We help entrepreneurs build product roadmaps and milestones, determine and measure customer metrics, establish product rollout strategy, and making practical decisions to enhance growth and profitability. - User Experience Design: We research the user workflows and come up with designs which are intuitive to use. Every product is wire-framed screen to screen and consensus is reached with the customer before implementation begins. 2. Cloud-native App Development Modern applications can become huge very quickly with ever expanding scale and changing requirements. The size of data and needs for intelligence also keep increasing. Cloud-native micro-services platforms and robust frontend technologies are necessary to handle these challenges. - Frontend Development: We utilise structured process to convert user experience needs into smoothly working web and mobile apps. We prefer using React and React Native, which are some of the most battle tested frontend platforms. - Microservices Development: We architect and develop micro-services backends using the best backend platforms for the job. We are especially in love with Node and Python; and we like throwing Kafka into the mix. - Containers & Cloud: We use Docker from development to production, and prefer using Kubernetes to orchestrate all kind of workloads while seamlessly integrating with public cloud services when required. - DevOps Practices: We test and build our code automatically in continuous integration and deployment systems, and staging environments are orchestrated so that code can be rolled out to production with confidence. - Operations & Monitoring: We build supporting infrastructure for crash reporting, metrics, logging, request tracing, alerting, security, etc., so that any anomalies can be detected and remedied quickly. 3. Machine Learning & Analytics Customers now expect every app to be smart. Business people also need more visibility into data to make good decisions. Processing large amounts of data and building artificial intelligence is almost integral to every modern software. - Data Engineering: We build data pipelines, data lakes and methodologies for collection, formatting, storage, transfer, and processing of data using the most appropriate big data platforms and modern stacks. - Machine Learning: We use proven statistical tools to make sense of data, build machine learning models to intelligently extract inferences, predict behaviour and prescribe appropriate actions. - Analytics & Visualisations: We build dashboards to visualise data and metrics in realtime to get visibility about your business. We use exploratory tools to run extract insights used to analyse and plan for the future."
  },
  {
    "Name": "QuellxCode",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 0,
    "Website": "https://quellxcode.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "QuellxCode is an extremely experienced <a href=\"https://quellxcode.com/software-house-in-islamabad/\">software house in Islamabad</a> which provides a wide array of social apps, productivity apps, games, and e-commerce apps for brands around the world. In the bunch of <a href=\"https://quellxcode.com/software-house-in-islamabad/\">software houses in Pakistan</a> we uniquely focus on effective design, cutting-edge technology, and cost-effectiveness throughout our development process for brands looking to leverage mobile technology. If you’re looking for a <a href=\"https://quellxcode.com/software-house-in-islamabad/\"> software house in Islamabad</a>, <a href=\"https://quellxcode.com/software-house-in-islamabad/\">Software house in Bahria town</a> or <a href=\"https://quellxcode.com/software-house-in-islamabad/\">best software house in Pakistan</a>, Quell X Code is all set to serve you with nothing but the best!"
  },
  {
    "Name": "Al Malik Universal",
    "Rate": "$50 - $99/hr",
    "Employee": "",
    "Founded": 2015,
    "Website": "http://almalikuniversal.com/",
    "location": "Contact information Al Malik Universal Room #: 29, 3rd Floor, Fareed Chamber,Abdullah Haroon Road, Saddar, Karachi., Karachi, Sindh 75080 Pakistan 02135633003",
    "CITY": "Karachi",
    "FocusArea": "Customized Software Development Software Implementation Web Site Designing Software Documentation Business Processes Documentation Computer Training (Oracle Developer & Oracle ADF) Marketing and Sales Provision of Manpower Services (Temporary / Permanent, Technical /Non-Technical)"
  },
  {
    "Name": "Al-Burraq Technologies",
    "Rate": "NA",
    "Employee": "10 - 49",
    "Founded": 2013,
    "Website": "https://www.al-burraq.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Al-Burraq best web designing services in USA or you are eager to Discover, define and deliver a mobile strategy for the effective deployment of your mobile initiatives?"
  },
  {
    "Name": "Zurash",
    "Rate": "NA",
    "Employee": "",
    "Founded": "",
    "Website": "http://zurash.move.pk/",
    "location": "Contact information Zurash 1, Karachi, Sindh 75330 Pakistan 03310457813",
    "CITY": "Karachi",
    "FocusArea": "Built for developers Zurash is built to make your life easier. Variables, build tooling, documentation, and reusable components."
  },
  {
    "Name": "Team Target",
    "Rate": "< $25/hr",
    "Employee": "2 - 9",
    "Founded": 2019,
    "Website": "https://teamtarget.dev/",
    "location": "",
    "CITY": "",
    "FocusArea": "Individual Developer If you want to start with just one developer, it is easy to start with. Single developer team is economical and easy to manage. You can grow your team any time you need to. Technologies We excel in more than one technologies. We mainly work in Asp.Net, Mvc, Web Form, Sql Server, Nodejs, iPhone, Android but not limited to these. Constantly in Contact Your team will be constantly in contact with you all the time over skype. You can regularly get updates on progress and talk to them any time you want during working hours."
  },
  {
    "Name": "Cyber Intelligent Solution",
    "Rate": "$50 - $99/hr",
    "Employee": "",
    "Founded": 2009,
    "Website": "http://cyberisol.com/",
    "location": "Contact information Cyber Intelligent Solution 160-Ahmed Block Garden Town, Lahore, Punjab, Lahore, Punjab 54000 Pakistan 03208108070",
    "CITY": "Lahore",
    "FocusArea": "Get the best school management software in Lahore, Karachi, Islamabad, & Pakistan. We are professional in making custom electronic school management systems and also in retailer software. Cyberisol offers the best online food ordering application for restaurants. Get customizable online cheapest food delivery app will handle management tasks. The food ordering app will handle management tasks. That will reduce the expense and will increase your revenue."
  },
  {
    "Name": "Globex IT Solutions Pakistan",
    "Rate": "NA",
    "Employee": "10 - 49",
    "Founded": 2005,
    "Website": "https://www.globexitsolutions.com.pk/",
    "location": "",
    "CITY": "",
    "FocusArea": "SEO, SMO, Digital Marketing, Graphic Designing, web designing, web development, content writing."
  },
  {
    "Name": "Clustox",
    "Rate": "< $25/hr",
    "Employee": "10 - 49",
    "Founded": 2012,
    "Website": "http://clustox.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "The Clustox Way Creating great software is a lot like cracking a giant jigsaw. If you don't look at the big picture, you can't make the pieces fit. At Clustox, we don't build software that just meets current customer needs. Instead, we engineer for the future, always keeping in sight the bigger picture: lasting and recurring customer value. That is why we don't 'create' solutions. We 'co-create' them by working together with our customers at every step. Inspired by challenges We thrive on challenges. The more complex a project, the more creative our solution. Over the past two decades we have mastered the art and science of executing complex, mission-critical IT projects. The key to our success in the most complex of assignments has been our willingness to question tightly held assumptions and abandon set work methods to find more innovative and efficient solutions. Our business solution and technology teams go the extra mile to understand project requirements and customer needs before delivering solutions that create long-term value. Driven by Processes Unless they are channelized effectively, creativity and innovation can easily become diffused in a large organization. Which is why, mature processes and robust methodologies are critical to the success of a software company."
  },
  {
    "Name": "zAmtech",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2014,
    "Website": "https://www.zamtech.co/",
    "location": "",
    "CITY": "",
    "FocusArea": "zAmtech.co We are dealing in Android, ios and web devlopment. We also provide services of Software Solutions consultant, Quality Assuearnace and testing report of product with SEO and Social Media Marketing as well."
  },
  {
    "Name": "Denovers",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2018,
    "Website": "https://denovers.com/",
    "location": "Contact information Denovers suite no 1012, alnajeebi towers, Karachi, Sindh 75600 Pakistan 03122381468",
    "CITY": "Karachi",
    "FocusArea": "- UI/UX Design - App Development - SaaS Development - Clickable Prototype - Rapid MVP Development"
  },
  {
    "Name": "Brainiac Studio",
    "Rate": "NA",
    "Employee": "",
    "Founded": 2016,
    "Website": "https://www.brainiac.studio/",
    "location": "Contact information Brainiac Studio c4, block b, gulshan e jamal, rashid minhas road, Karachi, Sindh 74200 Pakistan +923238226112",
    "CITY": "Karachi",
    "FocusArea": "Mobile app development website development custom software development digital marketing ecommerce development seo social media marketing content creation digital pr"
  },
  {
    "Name": "Rolustech",
    "Rate": "NA",
    "Employee": "50 - 249",
    "Founded": 2008,
    "Website": "https://www.rolustech.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "SugarCRM​SugarCRM Customization SugarCRM Integration SugarCRM Migration SugarCRM Plugins SugarCRM Support SugarCRM Licenses SugarCRM Upgrade SugarCRM Industry Specific Solutions Salesforce​Salesforce Consultancy Salesforce Implmentation Salesforce Customization Salesforce Integration Salesforce Data Migration Salesforce Support & Training Salesforce Industry Vertical Solutions Development Services Mobile Application Development Magento Website Development Magento Customization Magento CRM Integration Alexa Skill Development Machine Learning Services Product Development"
  },
  {
    "Name": "Suave Solutions",
    "Rate": "$100 - $149/hr",
    "Employee": "10 - 49",
    "Founded": 2004,
    "Website": "http://suavesol.net/",
    "location": "",
    "CITY": "",
    "FocusArea": "iPhone & iPad Application Development Android Application Development Website Design & Development Offshore Development Services Search Engine Management & Optimization services Mobile Game development UI UX and Graphic Design Services E-commerce Setup and Managed Services Social Media Marketing Services"
  },
  {
    "Name": "Zain Hosting",
    "Rate": "< $25/hr",
    "Employee": "2 - 9",
    "Founded": 2010,
    "Website": "https://www.zainhosting.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "STARTER $4.99 /Year Regularly $11.99 Order Now 1GB Web Space 10GB Bandwidth 10 Email Accounts 10 Subdomains 10 MYSQL Databases FREE Setup (No Hidden Charges) 99.9% Service Uptime BUSINESS $9.99 /Year Regularly $19.99 Order Now 5GB Web Space 20GB Bandwidth 20 Email Accounts 20 Subdomains 20 MYSQL Databases FREE Setup (No Hidden Charges) 99.9% Service Uptime PREMIUM $19.99 /Year Regularly $29.99 Order Now 10GB Web Space 50GB Bandwidth 50 Email Accounts 50 Subdomains 50 MYSQL Databases FREE Setup (No Hidden Charges) 99.9% Service Uptime DEDICATED $29.99 /Year Regularly $$49.99 Order Now Unlimited Web Space Unlimited Bandwidth Unlimited Email Accounts Unlimited Subdomains Unlimited MYSQL Databases FREE Setup (No Hidden Charges) 99.9% Service Uptime"
  },
  {
    "Name": "Origami Studios",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2012,
    "Website": "https://www.origamistudios.us/",
    "location": "",
    "CITY": "",
    "FocusArea": "Core Project Competencies Our trusted partner of modern enterprises, SMBs, and startups. We provide full-cycle custom software development services that lead companies to growth and sustainability. With a proven record of delivering beautiful software products and consultancy, we are here to offer you services and strategies that drive innovation, build brand equity, and increase your revenue. App Development Web Development Product Engineering UI/UX Design Artificial Intelligence Augmented Reality Virtual Reality Staff Augmentation Trending Technology"
  },
  {
    "Name": "ArhamSoft",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 1999,
    "Website": "https://www.arhamsoft.com/",
    "location": "Contact information ArhamSoft Office # 17 / N Block, Main Blvd, Johar Town, Lahore Pakistan, Lahore, Punjab 54000 Pakistan +923224352590",
    "CITY": "Lahore",
    "FocusArea": "The company always supports product development and startups. Arhamsoft has successfully developed the clone (Same functionality) applications like Uber, Yelp, Freelancer, Air BnB etc."
  },
  {
    "Name": "Focusteck",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2013,
    "Website": "https://www.focusteck.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "To learn more about our services, please check out https://www.focusteck.com/services"
  },
  {
    "Name": "The Net Hawks",
    "Rate": "$50 - $99/hr",
    "Employee": "10 - 49",
    "Founded": 2012,
    "Website": "http://thenethawks.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "App Development, Website Development, Supply Chain Management, and Software Development."
  },
  {
    "Name": "Cavemen Design",
    "Rate": "NA",
    "Employee": "",
    "Founded": 2011,
    "Website": "https://caveman.design/index.html",
    "location": "Contact information Cavemen Design Khaban e Jami, Karachi, Sindh 75400 Pakistan 02138882379",
    "CITY": "Karachi",
    "FocusArea": "Search Engine Optimization We know how to tweak particular factors to affect search engine standing and make certain pages more attractive Copywriting & Content Marketing Pictures tell. Words sell. From professional copywriters to business owners, you will find the solution for your copywriting needs here. Social Media Marketing We coordinated marketing effort to reinforce or assist with a business goal using one or more social media platforms Social Media Account Handler We manage and handle your social media account and help keep them updated. App Store Optimization We provide the best App Store Optimization Services to optimize Application stores by constantly observing the rules of professional and ethical guidelines Influencer Marketing We involve endorsements from influencers & people who possess a purported expert level of knowledge or social influence in their respective fields Mobile Marketing We focus at reaching a specific audience on their smartphones, feature phones, tablets, or any other related devices through mobile applications Video Marketing We create character & videos to increase audience engagement through social activity around a given video PPC - Pay Per Click If you are looking for a immediate boost, We offer PPC campaign management, ensuring that the money you spend is put to work for your business"
  },
  {
    "Name": "Courioo Technologies",
    "Rate": "NA",
    "Employee": "",
    "Founded": 2018,
    "Website": "http://www.couriootechnologies.com/",
    "location": "Contact information Courioo Technologies Al Barsha 1, Dubai, Dubai, Dubai 37396 United Arab Emirates +971 800 268 7466 Courioo Technologies Plot 487, Block G3 Block G 3 Phase 2 Johar Town, Lahore, Punjab 54782 Pakistan View more",
    "CITY": "Lahore",
    "FocusArea": "Bespoke Development Dedicated Teams Software Maintenance Mobile App Development UI/UX Testing & QA Digital Transformations & Data Migrations Project & Process Management Product Strategy Big Data Analytics Robotic Process Automation Fintech Website Development Software Development Managed IT Services Digital Marketing Design Data Analytics / BI IoT Development DevOps & Networks"
  },
  {
    "Name": "LEADconcept",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2003,
    "Website": "http://www.leadconcept.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "LEADconcept is a hub of technology and a distinction among web design firms that offer a full range of IT services (such as outsource software development work) that are constantly being accentuated with new trends and technologies. We can pick up a project from any phase and complete it on time and within budget using our highly successful project development methodology. We use Change control techniques to facilitate clients in modifying solutions whether it's in the design or in development phase. No project is taken 'lightly'. From simple logo designing to large projects, we ensure client satisfaction in every step of the way. We also pay a high premium on understanding your business goals and working model."
  },
  {
    "Name": "The Right Software",
    "Rate": "< $25/hr",
    "Employee": "10 - 49",
    "Founded": 2016,
    "Website": "https://therightsw.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Our services include Custom Websites for businesses Laravel OpenCart WordPress Laravel Typo3 MODx Android and iOS apps Native Android apps Native Mobile apps Email Marketing solutions MailChimp GetRespnose SendGrid Setup Ecommerce Store WooCommerce OpenCart Magento Custom Laravel Shopping Cart Business Process Automation Hacked website recover and repair Dedicated developer setup"
  },
  {
    "Name": "Zak Technology Services",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2007,
    "Website": "http://zakts.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Mobile App Development, Web Development, SEO/SEM, Desktop Application Development, Offshore Development, IT Support"
  },
  {
    "Name": "AALOGICS (PVT)LTD",
    "Rate": "NA",
    "Employee": "50 - 249",
    "Founded": 2014,
    "Website": "http://www.aalogics.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "AAlogics (Pvt) Ltd provide software development services that include: Web development, Social Media Marketing, and Mobile Application development. We are a team of professional coders, tech-savvy designers, and marketing specialist IT-Graduates with 16 years of education in English. We work with utmost care to lead our clients through their web requirements successfully. We work with the idea that our success lies in our client\"s success. Cloud Platforms Amazon web services LAMP (Linux, Apache, MySQL, PHP) - PHP 4/5/7, Frameworks: CakePHP, CodeIgniter, Laravel, Zend, Symfony2, Yii Methodologies: RESTFUL Services, MVP, MVC, MVVM, Agile, SCRUM. Test Driven Development: PHPUnit * GUI Design CSS3, HTML5, AJAX, Branding, Responsive Design Web Content Management System Drupal, Wordpress * eCommerce solutions - Magento Community Edition, Magento Professional and Enterprise Edition, Magento Certified Developer. - Opencart - Woocommerce - Joomla Mobile Applications iOS, Android * Databases MongoDB, MySQL, DynamoDB, SQLite We are available from Mon-Sat (11 AM to 9 PM UTC/GMT +5). We can work up to 40-60 hours per week."
  },
  {
    "Name": "Herald Lynx",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2014,
    "Website": "https://www.heraldlynx.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "We are providing the services: Web Design & Development Android Application Development Domain & Web Hosting Service Social Media Marketing Service Search Engine Optimization Service Security Solution Management Service ERP Solution Point Of Sale Solution"
  },
  {
    "Name": "Cyber Design",
    "Rate": "< $25/hr",
    "Employee": "10 - 49",
    "Founded": 2009,
    "Website": "https://cyberdesignpk.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Graphic Desiniging Social media marketing Advertising Services Corporate photography Web designing Software Development Application development (mobile/ Desktop) (IOS, Android) Domain & hosting Creative Content Writing SEO services Ui Ux desgin services Api intergration eCommerce Development"
  },
  {
    "Name": "Arpatech",
    "Rate": "$100 - $149/hr",
    "Employee": "250 - 999",
    "Founded": 2003,
    "Website": "http://www.arpatech.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Web Development Mobile App Development Cloud Hosting Software Development Startup Magento Development Magento Mobile Application Ecommerce Development It Resource Allocation & Managment Business Intelligence Business Process Outsourcing Digital Marketing"
  },
  {
    "Name": "Vision Plus",
    "Rate": "< $25/hr",
    "Employee": "",
    "Founded": 2003,
    "Website": "https://www.visionplus.com.pk/",
    "location": "Contact information Vision Plus 224 A new mulsim town, Lahore, Punjab 56000 Pakistan",
    "CITY": "Lahore",
    "FocusArea": "Web Design & Development Software Development E Commerce Development Mobile Apps Development"
  },
  {
    "Name": "Hello world technologies",
    "Rate": "$100 - $149/hr",
    "Employee": "10 - 49",
    "Founded": "",
    "Website": "https://hwryk.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Web Development Our team of web developing is collect, implement, and apply design principles through web pages. We don’t build websites we build your trust.Our Strategy & Consulting Hello World Technologies team works closely with the clients in the initial findings study group to understand our target customer and to create a unique and Avant-grade web user experience that converts visitors into customers. We turn new ideas into execution. software development company in pakistan"
  },
  {
    "Name": "BrandJaws",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2012,
    "Website": "http://www.brandjaws.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "The platform where information, design, and technology are integrated to deliver a finely architected solution. From designing a website for your products to creating software for your projects, our dedicated team of IT professionals has got your back. Our services include: UI/UX Product Design Full-Stack Web Development Android/iOS Mobile Development Best Enterprise Solutions Dedicated Virtual Teams Enterprise Solut"
  },
  {
    "Name": "Vaival Techonology",
    "Rate": "$25 - $49/hr",
    "Employee": "50 - 249",
    "Founded": 2010,
    "Website": "https://vaival.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "a"
  },
  {
    "Name": "CHROMEIS PVT LTD",
    "Rate": "< $25/hr",
    "Employee": "2 - 9",
    "Founded": 2015,
    "Website": "https://chromeis.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Cloud Servers Dedicated Pysical and Virtual servers Shared/Personal Hosting Managed Servers Java/Tomcat Server"
  },
  {
    "Name": "SW3 SOLUTIONS PVT LTD",
    "Rate": "NA",
    "Employee": "2 - 9",
    "Founded": 2005,
    "Website": "https://www.sw3solutions.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "1- Website Design and Development, 2- Web Applications, 3- eCommerce Solutions, 4- Mobile Aaps Development, 5- Payment Method Integration, 6- Website Maintenance, 7- Logo Design, 8- Domain Registration, 9- Web Hosting, and 10- APIs Integration (3rd Party)"
  },
  {
    "Name": "Casia Apps",
    "Rate": "NA",
    "Employee": "",
    "Founded": 2018,
    "Website": "https://www.casiaapps.com/",
    "location": "Contact information Casia Apps Suite no 402, 11 - C, Lane - 3, Zamzama, Phase - V, D.H.A. | 75500 - Karachi, Karachi, Sindh 75500 Pakistan +922137247641",
    "CITY": "Karachi",
    "FocusArea": "Website Design Website Redesigns Website SEO Mobile App Development Web Programming Digital Marketing SEO Social Media Marketing"
  },
  {
    "Name": "Codez Craft",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2017,
    "Website": "https://www.codezcraft.com/",
    "location": "Contact information Codez Craft HeadOffice # 32, Kiran Arcade, Bufferzone, 15-A/2, North Nazimabad, Karachi, Karachi, Sindh 75850 Pakistan +923323447442 Codez Craft 2435 N. Central Expressway,Suite #1200, Richardson, Texas, Richardson, Texas 75081 United States 214-475-2511 View more",
    "CITY": "Karachi",
    "FocusArea": "Creative Designing Web Design Web Development Mobile App Development Software Development Seo / Sem Web Maintenance Services"
  },
  {
    "Name": "Icreativez Technologies",
    "Rate": "< $25/hr",
    "Employee": "10 - 49",
    "Founded": 2009,
    "Website": "https://www.icreativez.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Web Design & Web Development, E Commerce Solutions, Software Development, Digital Maketing, Software Quality Assurance, Branding"
  },
  {
    "Name": "Techtics",
    "Rate": "< $25/hr",
    "Employee": "",
    "Founded": 2017,
    "Website": "http://www.etechtics.com/",
    "location": "Contact information Techtics Jeff Heights - Gulberg III - Call Pak +92 423 575 1034, Lahore, Punjab 54000 Pakistan +1 571 206 5487",
    "CITY": "Lahore",
    "FocusArea": "Contact us if you need access to a world-class Web & Mobile Development team? ASP.Net Zero Application Developers Web Application Design & Development Mobile Application Development Custom Software Application Development Dedicated Development Teams Ecommerce Business Software Solutions Desktop Software Development User Experience & Design Agile Discovery Workshop (ADW) Business Process Automation Enterprise Mobility Solutions Web & Enterprise Portal Solutions"
  },
  {
    "Name": "Creative Ideator",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2017,
    "Website": "https://www.cideator.com/",
    "location": "2 15th Commercial Street, Karachi, Sindh, Pakistan;021 35315233",
    "CITY": "karachi",
    "FocusArea": "Mobile App Development ( Native Android, iOS, Hybrid ) Cross-Platform App Development Artificial Intelligence and Machine Learning Web and SAAS platform Development UI and Front-End Development"
  },
  {
    "Name": "DevCrew.io",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2015,
    "Website": "http://devcrew.io/",
    "location": "Contact information DevCrew.io MM Alam Road, Gulberg 3., Lahore, Punjab Pakistan +924235771590",
    "CITY": "Lahore",
    "FocusArea": "DevCrew.io provide native mobile application development for all major platforms, including iOS, Android and Windows phone. We are experts in product design, development and product management when it comes to delivering enterprise systems & mobile applications. We work alongside with our clients to determine the best solution for their budget."
  },
  {
    "Name": "likeitsolutions",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2019,
    "Website": "https://likeitsolutions.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Product design service helps you define your product vision and roadmap. Our customer-centric approach ensures your product is shaped to fit real customer needs. We combine technology expertise with Design Thinking, helping you craft user experiences that drive engagement."
  },
  {
    "Name": "Dream Beyond",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2014,
    "Website": "http://letsdreambeyond.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Our Services Include: Enterprise Level Line of Business Applications Web Application Development (SaaS, LOB) Mobile Application Development (iOS, Android, React Native Cross-Platform App Development) E-Learning Solutions, Insurance Claim Solutions E-Commerce Applications"
  },
  {
    "Name": "MMC Global",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 1995,
    "Website": "https://mmcgbl.com/",
    "location": "Contact information MMC Global A-13, Al-Hilal Society, Opp Askari Park, KDA Scheme No.7, Karachi, Karachi, Sindh 740000 Pakistan 03111555053",
    "CITY": "Karachi",
    "FocusArea": "MMC GLOBAL is an industry leader in providing Professional Website Design , development, Applications and Mobile Solutions."
  },
  {
    "Name": "Creative Tugs",
    "Rate": "< $25/hr",
    "Employee": "",
    "Founded": 2014,
    "Website": "http://www.creativetugs.com/",
    "location": "Contact information Creative Tugs B-8, Block 2, Gulistan-e-Juhar, Karachi, Karachi, Sindh 75300 Pakistan",
    "CITY": "Karachi",
    "FocusArea": "Branding Graphics Website development Web application SaaS software Search Engine Marketing"
  },
  {
    "Name": "Business Boosters",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2013,
    "Website": "https://boostersdesign.com/",
    "location": "Contact information Business Boosters 777 S. Alameda, Los Angeles, California 90021 United States 213-267-0257 Business Boosters 1090 Homer Street, Vancouver, British Columbia V6B 2W9 Canada 778-200-7606 Business Boosters Suit no 213 Hotel Imperial PIDC, Karachi, Sindh 94103 Pakistan 0213-2667837 View more",
    "CITY": "Karachi",
    "FocusArea": "We Offer Website Development, Custome Web Development, Application Development. Custome E-Commerce, Magento, Woocommerce, Portal Development, Software Development, We perform Software, Website & Application Testing And Security Service We have industry experts who are extra expertise in developing the Web Portal, B2B, B2C Portal for Clients."
  },
  {
    "Name": "Xcentric Services",
    "Rate": "$50 - $99/hr",
    "Employee": "",
    "Founded": 2006,
    "Website": "https://www.xcentricservices.com/",
    "location": "Contact information Xcentric Services Dirza Service Apartment near al rabwa park, khurais road near kubri khaleej, Riyadh, Riyadh 11543 Saudi Arabia +92-300-8002084 Xcentric Services 787 Handley CT, Lake Zurich, Chicago, Illinois 60047 United States 7083001567 Xcentric Services 2nd Floor, 38-Z Phase III, DHA Lahore, Lahore, Punjab 54000 Pakistan +92-42-35693141 View more",
    "CITY": "Lahore",
    "FocusArea": "Large-scale ERP solutions E-commerce creations Digital campaigns ERP deployment Technology consultancy E-commerce website development Web design E-commerce Magento Development Platform Shopify Development Platform CRM Digital marketing & SEM and branding SEO services Chicago Chicago SEO Shopify Pakistan"
  },
  {
    "Name": "Bitsclan Solutions Pvt Ltd",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2016,
    "Website": "https://www.bitsclan.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Web Application Development: - Languages & Tools: (PHP (Laravel, Codeigniter, Cake, Yii, Symphony), .NET, JS(Core, Node, Angular, React), jQuery, HTML5, CSS3, CMSs(Wordpress, Joomla, Magento, Opencart), Webs Services & APIs, CRMs (Perfex, Sugar)) Desktop & Mobile Application Development: - Languages & Tools: (.NET, Electron Js, C#, Native Android & IOS, Swift & C, React Native)"
  },
  {
    "Name": "TechLatitude",
    "Rate": "$50 - $99/hr",
    "Employee": "",
    "Founded": 2015,
    "Website": "http://techlatitude.com/",
    "location": "Contact information TechLatitude 53 CCA, 4th Floor, Phase 5, DHA, Lahore, Punjab 54000 Pakistan +923238490482",
    "CITY": "Lahore",
    "FocusArea": "We are a full-service digital agency that provides end to end solutions for our clients. Our services include: App Development Web Development Digital Marketing PPC Lead Generation Digital Strategy Social Media Marketing Search Engine Marketing"
  },
  {
    "Name": "Devdap",
    "Rate": "< $25/hr",
    "Employee": "",
    "Founded": 2018,
    "Website": "https://devdap.com/",
    "location": "Contact information Devdap 17, Rawalpindi, Punjab 47040 Pakistan +923135389830",
    "CITY": "Rawalpindi",
    "FocusArea": "Focus Industries: Education (Online Education Industry) Startups Technologies we use: Python Django Bootstrap Wordpress Amazon Web Services Google App Engine JavaScript SQL PostgreSQL SQLite"
  },
  {
    "Name": "Codility Solutions",
    "Rate": "< $25/hr",
    "Employee": "",
    "Founded": 2018,
    "Website": "https://www.codility.co/",
    "location": "Contact information Codility Solutions Frugthaven 39, Valby, Copenhagen, Copenhagen 2500 Denmark +4529170335 Codility Solutions Civic Center, Faisal Town, Lahore, Punjab 54700 Pakistan +923224426027 View more",
    "CITY": "Lahore",
    "FocusArea": "Custom ERP Developmet Mobile App Development Web App Development eCommerce Store Development Custom Business Application Development Didital Marketing Services Software as a Services Cloud Services Development ( SAAS) Project Management Quality Assurance Front End technologies: HTML, HTML 5, CSS, CSS 3, JavaScript, JQuery, Angular, React JS, Vue JS, Ember Back End technologies: Ruby on Rails, Node JS, Shopify, Python, ASP Dot Net, PHP, Laravel, Symphony, Magento 2x Drupal, Mobile App Technologies: Native android, IOS Swift, Native Script, React Native Flutter. Cloud Technologies: AWS, BC2, SS, Cloud Front, Lambda, AQS, SNS, Elastic Transcoder, Cloud Watch, Router 53, Google Net, Azure. Database Technologies: MySQL, SQL, TSQL, PostgreSQL, Oracle, DyamoDB, RDS, MongoDB, SQlite."
  },
  {
    "Name": "SEO XOOM",
    "Rate": "< $25/hr",
    "Employee": "10 - 49",
    "Founded": 2010,
    "Website": "https://www.seoxoom.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Pay Per Click Web Optimization Seo Services Web Development Email Marketing Web Analytics Virtual Marketing Social Media"
  },
  {
    "Name": "WAMPDO",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2015,
    "Website": "https://www.wampdo.com/",
    "location": "Contact information WAMPDO P-29 St # 3 kareem town, Faisalabad, Punjab 38000 Pakistan +923167816256",
    "CITY": "",
    "FocusArea": "Every project is an adventure for us but our core expertise lies in the areas of responsive website development, custom CMS websites and eCommerce stores building. We work in the pursuit of service excellence with complete customer satisfaction. We provide web development, software development, Graphic designing and Ecommerce services"
  },
  {
    "Name": "Aqute Solutions",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2016,
    "Website": "http://aqutesolutions.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Mobile Application Development(Android, iOS, Cross platform) Software Development(IoT,Industrial Automation,) Web Development(Website,Ecommerce,POS,Portal Development) Graphic Designing"
  },
  {
    "Name": "Codexier Inc",
    "Rate": "< $25/hr",
    "Employee": "",
    "Founded": 2017,
    "Website": "https://www.codexier.com/",
    "location": "Contact information Codexier Inc Office 108, 1st Floor, Paris Shopping Mall, Near UBL, PWD Road, Islamabad, Federal Capital Area 46000 Pakistan +92 51 519 4055",
    "CITY": "Islamabad",
    "FocusArea": "Custom Software Development Custom Website Development Mobile App Development Digital Marketing Graphic Design"
  },
  {
    "Name": "United Sol",
    "Rate": "NA",
    "Employee": "",
    "Founded": 2006,
    "Website": "http://www.unitedsol.net/",
    "location": "Contact information United Sol Street 4 i9/3, Islamabad, Federal Capital Area 46000 Pakistan +92518442246",
    "CITY": "Islamabad",
    "FocusArea": "Website Design Web Development Magento Solutions Search Engine Optimization Social Media Marketing Wordpress Development WooCommerce Development PrestaShop Development"
  },
  {
    "Name": "INNOSOLS",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2012,
    "Website": "http://innosols.info/",
    "location": "Contact information INNOSOLS 1975, Indus Road, Rawalpindi, Punjab 46000 Pakistan +923215219857 INNOSOLS 504 Rathburn Rd E, Mississauga, Ontario L4Z 1V6 Canada +1 647 367 0409 INNOSOLS ABC Accelerator Smartinska Cesta, Slovenian Littoral 152,1000 Slovenia +386 40 511921 View more",
    "CITY": "Rawalpindi",
    "FocusArea": "Customized Software ERP Solutions Web Development Enterprise Desktop Applications Mobile Application Development Business Process Outsourcing Enterprise Marketing Solutions"
  },
  {
    "Name": "Bramerz",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2006,
    "Website": "https://bramerz.pk/",
    "location": "Contact information Bramerz 512-16 Harrison Garden Blvd., Toronto, Ontario M2N 7J6 Canada +1.639.916.2331 Bramerz 12-D, Phase 5, DHA, Lahore, Punjab 54000 Pakistan +92.300.8486070 View more",
    "CITY": "Lahore",
    "FocusArea": "Bramerz services include but are not limited to creative ideation, content creation, e-commerce, web & mobile development, digital media management, online marketing, UI/UX, product management, online publishing, monetization, community management, digital PR, event management, etc.."
  },
  {
    "Name": "Phoenix Technologies",
    "Rate": "NA",
    "Employee": "",
    "Founded": "",
    "Website": "https://phoenixtechnologies.co/",
    "location": "Contact information Phoenix Technologies Gulshan-e-Iqbal, Karachi, Sindh 75300 Pakistan 021-34975773",
    "CITY": "Karachi",
    "FocusArea": "network solutions, videowall system, security system, website designing, and development, digital marketing, advertising"
  },
  {
    "Name": "Punjani Inc.",
    "Rate": "$50 - $99/hr",
    "Employee": "",
    "Founded": 2016,
    "Website": "http://www.punjani-inc.ml/",
    "location": "Contact information Punjani Inc. Suite # 202, Ruby Heights, Plot C - 12, Block 13-D 3, Gulshan - e - Iqbal Karachi, Karachi, Sindh 75300 Pakistan +923327472277",
    "CITY": "Karachi",
    "FocusArea": "our services include: 1. The Desktop, Mobile Application, and Website Designing and Development 2. Graphics Designing UI/UX 3. Consultations related to All I.T 4. Data Analytics and Business Growth Achieving all this shorter time is more than what we had anticipated, thanks to the hard work by our team members and the constant support from Allah Almighty."
  },
  {
    "Name": "Xaltant",
    "Rate": "< $25/hr",
    "Employee": "",
    "Founded": 2019,
    "Website": "http://www.xaltant.com/",
    "location": "Contact information Xaltant 71-C-III Gulberg - III, Lahore, Lahore, Punjab 54900 Pakistan +923334245619",
    "CITY": "Lahore",
    "FocusArea": "Website design & development, Mobile Applications, Graphic Designing, Software Development, Digital Marketing, iOS App Development, Android App Development, Web Maintenance, and Mobile App Maintenance"
  },
  {
    "Name": "Elexoft technology",
    "Rate": "< $25/hr",
    "Employee": "2 - 9",
    "Founded": 2015,
    "Website": "http://www.elexoft.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Elexoft is a top software house in Pakistan. We offer our services in web designing, crm system, digital marketing and mobile apps development"
  },
  {
    "Name": "RevnoSoft",
    "Rate": "$25 - $49/hr",
    "Employee": "50 - 249",
    "Founded": 2015,
    "Website": "https://www.revnosoft.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Web Development Mobile Apps Development Agile Software Development System Integrations ERPs SLA IoT Office Automation systems Product/Service Development"
  },
  {
    "Name": "ZED Technologies",
    "Rate": "< $25/hr",
    "Employee": "2 - 9",
    "Founded": 2019,
    "Website": "http://zedtech.zedint.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Website development, SEO Optimization, Branding & Marketing, Domain Registration & Web Hosting Services. We offer a range of services that mainly revolve around business development, expansion and new market reach. The tools that enable these are website development, branding & imaging , domain registration & web hosting, SEO Optimization, PPC Campaign management, Social Media Marketing management, Custom ERP & CRM Solutions. All these modules have to be synced humbly to generate desired results for any business. Our range of services is for all types and sizes of business & enterprises ranging from new startups to multi branched enterprises looking for better & effective management tools ."
  },
  {
    "Name": "CodeJunkie",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2015,
    "Website": "https://www.codejunkie.co/",
    "location": "",
    "CITY": "",
    "FocusArea": "UI/UX Design Artificial Intelligence Machine Learning Augmented Reality Mobile App Development Web Application Development MVP Development API Development Full Stack Development Front-End Development Back-End Development Robotic Process Automation"
  },
  {
    "Name": "Shinersoft",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2007,
    "Website": "http://www.shinersoft.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "1) Health IT Development EMR EHR Meaningful Use Stage 2 & 3 experts Health Portals Health Apps Patient Self Registration KIOSK 2) Sharepoint 3) Microsoft Dynamics 4) Tools & Technologies Bootstrap JQUERY JSON Javascript CSS ANGULAR TYPESCRIPT ASP.NET CORE WEB API SQL Server MY SQL 5) Hardware Devices Integrations 1) Health IT Development EMR EHR Meaningful Use Stage 2 & 3 experts Health Portals Health Apps Patient Self Registration KIOSK 2) Sharepoint 3) Microsoft Dynamics 4) Tools & Technologies Bootstrap JQUERY JSON Javascript CSS ANGULAR TYPESCRIPT ASP.NET CORE WEB API SQL Server MY SQL 5) Hardware Devices Integrations"
  },
  {
    "Name": "Intellexal Solutions (ITS) Private Limited",
    "Rate": "NA",
    "Employee": "",
    "Founded": "",
    "Website": "https://its.com.pk/",
    "location": "Contact information Intellexal Solutions (ITS) Private Limited 2nd Floor, Bungalow No.136-B, S.M.C.H.S Block-B, Karachi, Karachi, Sindh 74400 Pakistan",
    "CITY": "Karachi",
    "FocusArea": "BULK SMS Bulk SMS Services have changed correspondence and taken it to an all new dimension. This has opened up lively new vistas for the Bulk SMS Service correspondence industry through cell phones. With innovative progressions and the expanding openness of cell phones, sending Bulk SMS is a simple method to contact individuals without spending an excess of cash. Intellexal Solutions is Pakistan number one Bulk SMS Service Specialist Organization and they give various alternatives to keep in contact with your clients, representatives and other noteworthy focused on crowd. We help you make a buzz in the market, making it a lot simpler than other conventional methods. We help you to rethink models and patch up your Mobile SMS Campaign Services with Bulk SMS Services. In Pakistan, the idea of Sending Bulk SMS is getting to be mainstream step by step. Branded SMS Services help to send tips, administration messages, alarms, updates and different types of correspondence to the clients over a wide land region. Then let’s have Bulk SMS Services in Pakistan. BRANDED SMS Intellexal Solutions is offering Branded SMS Marketing. Get Branded SMS Services in Pakistan. In spite of the fact that there are various organizations offering Branded SMS Services, they give incomplete outcomes and you can scarcely accomplish the ideal outcomes because of a few concealed debilitation. Our strategies are totally straightforward and our administrations are proficient to fulfill the fluctuated needs of clients. Our Branded SMS Services makes dealing with the database simpler and guarantees improved profitability after the mix of our Branded SMS into your corporate culture. Wherever in Pakistan your client is, our administrations convey your messages to them. We gloat of the amplest inclusion and are the Best Specialist Organizations for Branded SMS Services and Branded SMS Marketing in Pakistan. We are experienced Branded SMS Marketing firm who is already providing Branded SMS Services to brands and also catering Non-Branded Bulk SMS Campaigns for providing companies number of reputable clients. SMS Services in Pakistan Intellexal Solutions (ITS) is one of the Leading SMS Service providing Company in Pakistan. We provide SMS Services in Pakistan. Bulk SMS Services In Pakistan, SMS Marketing Services in Pakistan, Branded SMS Services in Pakistan, SMS Broadcasting Services in Pakistan, Short Code and Long Code Services in Pakistan. However, getting free Bulk SMS Services is illegal on specific numbers enlisted with the Do Not Disturb vault. We have keen channels that stay clear from sending SMS to such numbers, along these lines helping you keep away from confusions. We steer far from dishonest practices and are altogether proficient. With the assistance of our Branded SMS Marketing Service you can all around rapidly contact your clients wherever they be inside the Pakistan. Corporate organizations appreciate enormous advantages through our Bulk SMS Services in Pakistan. We give perfect answers for extend private ventures and firms into bigger ones. An immense number of organizations have seen huge development in business by the reaction they get from the clients."
  },
  {
    "Name": "Brand Republic",
    "Rate": "< $25/hr",
    "Employee": "10 - 49",
    "Founded": 2017,
    "Website": "https://www.brandrepublic.com.pk/",
    "location": "",
    "CITY": "",
    "FocusArea": "We provide: Software Development (Desktop) Mobile Application Development (Native and Hybrid) Web Application Development (ASP.Net, JavaScript, PHP) ERP Solutions CRM Websites (Static and Dynamic) SEO Solutions Digital Marketing and Graphic Designing"
  },
  {
    "Name": "ZEREFLAB",
    "Rate": "NA",
    "Employee": "",
    "Founded": 2019,
    "Website": "https://zereflab.com/",
    "location": "Contact information ZEREFLAB Y-112, Y-Block Commercial, DHA Phase 3, Lahore, Punjab 53720 Pakistan +923069197678",
    "CITY": "Lahore",
    "FocusArea": "Development Services, marketing services, product management, CRM, product design,"
  },
  {
    "Name": "Saplogics",
    "Rate": "< $25/hr",
    "Employee": "",
    "Founded": 2014,
    "Website": "http://www.saplogics.com/",
    "location": "Contact information Saplogics 21st commercial st, Karachi, Sindh 75500 Pakistan",
    "CITY": "Karachi",
    "FocusArea": "Web Design and Development Graphic Design and Branding Animation Digital Marketing Customer Support Services"
  },
  {
    "Name": "CodeNinja Inc.",
    "Rate": "< $25/hr",
    "Employee": "",
    "Founded": 2015,
    "Website": "https://www.codeninja.us/",
    "location": "Contact information CodeNinja Inc. 2035 Suite B-2, Newark, Delaware 19702 United States +13025652177 CodeNinja Inc. 163MB, Phase 6, DHA, Lahore, Punjab 54810 Pakistan +923000040247 View more",
    "CITY": "Lahore",
    "FocusArea": "Branding Web Development App Development Software Development Cloud Server Management Data Analytics"
  },
  {
    "Name": "Granjur Technologies",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2012,
    "Website": "http://www.granjur.com/",
    "location": "Contact information Granjur Technologies 1013 2700 Aquitaine Avenue, Mississauga, Ontario L5N 3J6 Canada +1 (647) 858-2122 Granjur Technologies 148 A1 GECHS Township, Lahore, Punjab 54700 Pakistan 00923004455340 View more",
    "CITY": "Lahore",
    "FocusArea": "Artificial Intelligence Remote Staffing Mobile Application Development -iOS Native -Android Development -React Native Website Development -SAAS -CMS -E-Commerce Search Engine Optimization Amazon Management Services Design App Store Optimization Quality Assurance Project Management Digital Marketing Social Media Marketing Games"
  },
  {
    "Name": "Hicon Soft",
    "Rate": "$100 - $149/hr",
    "Employee": "",
    "Founded": 2003,
    "Website": "http://www.hiconsoft.com/",
    "location": "Contact information Hicon Soft Khumrial Centre, Plot 3-4, I & T Centre, G-8/4, Islamabad, Federal Capital Area 44000 Pakistan 92518316451",
    "CITY": "Islamabad",
    "FocusArea": "Web design and develoment, SEO, SEM, Web and mobile applications, e-commerce development and software development"
  },
  {
    "Name": "ASP.Net Zero Developers",
    "Rate": "< $25/hr",
    "Employee": "10 - 49",
    "Founded": 2019,
    "Website": "http://www.aspnetzerodevelopers.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Our Services Our ASP.Net Zero application development services are highly sophisticated and agile enough to cater to all your web and mobile application development needs at any point in time. Our certified engineers will help you develop and implement top-class business applications by leveraging our ASP.Net Zero-based expertise – we acquired over years of training and practice. Development from Zero We have good expertise in ASP.Net Zero development. Our experienced resources will help you to develop and design your applications in ASP.Net Zero. Code Migration and Framework Upgradation You can hire ASP.Net Zero application development team for various forms of code migrations and framework upgradation Dedicated Development Team Hire a dedicated development team of programmers and work with top developer and designers to develop your ASP.Net Zero product On Time and In Budget. Support & Maintenance You can engage with an experienced team of programmers for Support &amp; Maintenance of ASP.Net Zero Applications on Azure, AWS or even On-Premise."
  },
  {
    "Name": "Appedology Pvt Ltd",
    "Rate": "NA",
    "Employee": "",
    "Founded": 2019,
    "Website": "https://www.appedology.pk/",
    "location": "Contact information Appedology Pvt Ltd 2nd Floor, 66c- 68c, 25th Street, Tauheed Commercial Area Phase 5 Defence Housing Authority, Karachi, Sindh 75500 Pakistan +922135869888",
    "CITY": "Karachi",
    "FocusArea": "Web designing, Web Development, Mobile App Development, SEO Social Media, Video animation & Editing, Wordpress Development"
  },
  {
    "Name": "iExtend Labs",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2016,
    "Website": "http://iextendlabs.com/",
    "location": "Contact information iExtend Labs LG 55,56 IT Tower and shopping Center hali road Gulberg 3, Lahore, Punjab 54310 Pakistan 00923201430963",
    "CITY": "Lahore",
    "FocusArea": "We Provide Softwares In the following Categories. Online Shopping Websites CRM Management System Inventory Softwares"
  },
  {
    "Name": "Tech a Boo",
    "Rate": "< $25/hr",
    "Employee": "2 - 9",
    "Founded": 2017,
    "Website": "http://www.techaboo.co/",
    "location": "",
    "CITY": "",
    "FocusArea": "We provide software solutions to our worthy clients, which includes Website Development and mobile applications (IOS & Android). Cyber Security is our area of expertise. With the help our certified Microsoft professional, we have provided Penetration Testing and Vulnerability Assesment to many organizations to protect the usability and integrity of their network and data. We have the resource for Digital Marketing as well."
  },
  {
    "Name": "codeaze",
    "Rate": "NA",
    "Employee": "",
    "Founded": "",
    "Website": "https://www.codeaze.org/",
    "location": "Contact information codeaze Asia Pacific Trade Center, Rashid Minhas Rd, Karachi, Karachi, Sindh 17600 Pakistan 03002399959",
    "CITY": "Karachi",
    "FocusArea": "BPOContent Management SystemERPSEOSocial Media MarketingPoint Of SaleWeb DesigningWeb DevelopmentMobile App DevelopmentGraphic DesigningCRM ERPSEOSocial Media MarketingPoint Of Sale Web DesigningWeb DevelopmentMobile App DevelopmentGraphic DesigningCRM"
  },
  {
    "Name": "Dynamic Online Technologies (SMC-PVT) Ltd",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2010,
    "Website": "https://dynamiconlinetechnologies.com/",
    "location": "Contact information Dynamic Online Technologies (SMC-PVT) Ltd 68-B, Garden Block, New Garden Town, Lahore, Punjab 54000 Pakistan 03217728293",
    "CITY": "Lahore",
    "FocusArea": "Web Development Innovation is the key to success, and this is what sets us apart. Spill out your concerns regarding the upgrading of an existing website or creating a new one from scratch, our competent team will not let you down, we promise! Android Development If you want to hit beyond 2 billion active users on the android platform, then allow us to develop an extravagant android app for your business. iOS Development Our IOS developer will render the state of the art application with a future centric strategy. Custom Software Every business benefits from unique, customized and tailored software. The obvious benefits are improved productivity and we aim to deliver that no matter the size of the business. Digital Marketing Your company is defined by your brand. It’s how your customers recognize you. Lets us help you to build your brand online. Branding DOT has a team of experts dedicated to the branding design. Branding design is a complete process kicking off by comprehending the motive of your business, and the product you offer, followed by competitors, current position in the market, and target market."
  },
  {
    "Name": "e-strats",
    "Rate": "NA",
    "Employee": "10 - 49",
    "Founded": "",
    "Website": "http://estratcom.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "e-strats provides the following set of services to its clients: Web Application Development Dispatching and appointment solutions Work order scheduling management, Service mobile field worker app Intuitive Dashboard Scheduling systems Routing and tracking Estimate and invoices Accounting and Inventory Customer Engagement Project Management Cloud solutions Mobile App development Field force automation Field Service optimization"
  },
  {
    "Name": "Phaedra Solutions",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2013,
    "Website": "https://www.phaedrasolutions.com/",
    "location": "Contact information Phaedra Solutions Canal View, Lahore, Punjab 54000 Pakistan +16318874813",
    "CITY": "Lahore",
    "FocusArea": "We provide the following services: Mobile Development Web Development (Back-End / Front-End) Business IT Solutions Portal Development and Maintenance Ecommerce Solutions Content Management System"
  },
  {
    "Name": "Mojjari",
    "Rate": "< $25/hr",
    "Employee": "",
    "Founded": 1999,
    "Website": "http://www.mojjari.com/",
    "location": "Contact information Mojjari 10 Ali Arcade, Office No 3, Nashman e Iqbal , Lahore, Punjab 54000 Pakistan 923404079123",
    "CITY": "Lahore",
    "FocusArea": "Software Development Web Development Content Writing"
  },
  {
    "Name": "Oriental Tech Solutions",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2016,
    "Website": "http://orientaltechs.com/",
    "location": "Contact information Oriental Tech Solutions %3, J2, Johar Town, Lahore, Punjab 54782 Pakistan 00924232085406",
    "CITY": "Lahore",
    "FocusArea": "we are working ofn different tech fieds and provoid ethe services of Mobile apps and games development for IOS and Android apps. The working of Graphics Designing where as we are working for UI/UX for apps, games, web and different other products. we have artist that are working on it to make you cool and give better results. our working for SEO, ASO, SMM for digital marketing. we have best analyst and we are also working on Artificial intelligence."
  },
  {
    "Name": "Hashe Computer Solutions",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 1998,
    "Website": "https://www.hashe.com/",
    "location": "Contact information Hashe Computer Solutions 225 Cavalry Grounds, Street 5, Lahore, Punjab 54810 Pakistan 923008406312 Hashe Computer Solutions 7518 East 39th Street, Indianapolis, Indiana 46226 United States Hashe Computer Solutions 27 High Street, Urunga, Sydney, New South Wales Australia View more",
    "CITY": "Lahore",
    "FocusArea": "Web Design, Software Development, SEO / SEM, Web and Desktop Based Application, IT Consultancy, Server Management, MVC .NET, Offshore Staffing &amp; IT Outsourcing."
  },
  {
    "Name": "Capazyte",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2017,
    "Website": "http://www.capazyte.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "We create and manage digital services inspired by the desires, needs, and aspirations of customers that make our client’s organizations work successfully Blessed with passionate and creative developers, Capazyte is an initiative from a handful of people who are obsessed with quality and innovation. Our aim is to achieve excellence in every product we make, and we strive for perfection every time we code."
  },
  {
    "Name": "KeyDevs",
    "Rate": "$25 - $49/hr",
    "Employee": "10 - 49",
    "Founded": 2007,
    "Website": "https://keydevs.com/",
    "location": "",
    "CITY": "",
    "FocusArea": "Web Design and Development Mobile Application Development Custom Software Development Digital Marketing Search Engine Optimization (SEO) Social Media Marketing (SMM) Email Marketing E-commerce Website Development Logo Design Profile and Portfolio"
  },
  {
    "Name": "Intellimus",
    "Rate": "$25 - $49/hr",
    "Employee": "",
    "Founded": 2011,
    "Website": "http://www.intellimus.com/",
    "location": "Contact information Intellimus 2nd Floor, 295 Q Commercial Area Phase II, D.H.A, Lahore, Punjab 54000 Pakistan +923004579782",
    "CITY": "Lahore",
    "FocusArea": "Below are all the areas we are experts in. Areas where we collaborate with our clients and help them build great products. Pick up the ones that fit you most. Web Development Services Professional team of expert web developers offering custom website design, web development, corporate branding, consultation and website management. Rails Development Services Do you have Product idea to start working with us? Enguage us on Ruby on rails application development for robust, secure, flexible and scalable applications. Let's bring it to life together! Mobile Application Development Looking to hire mobile app developers? Intellimus, a mobile app development company, specializes in mobile application development services. Hire our mobile app developers today! Web Design Services Looking for the best web design services offered at the right price? Let our website designers build your dream website. We have over 10 years of web design experience. Get a Quote! Drupal Development Services Looking to hire expert Drupal developers? Intellimus is a leading Drupal development company that provides a full range of Drupal development services. WordPress Development Services WordPress Development Company, Intellimus provides Custom WordPress Theme Design, Plugin Development, Website Development Services."
  },
  {
    "Name": "Abacus Consulting Technology (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.abacus-global.com",
    "location": "Abacus House, Lahore, Punjab, Pakistan;(92 42) 588-4981-5",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "AALogics (SMC-PVT.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.aalogics.com/",
    "location": "Office #301, 3rd Floor Rim Jhim Center Near Disco Bakery, Block 6, Gulshan-e-Iqbal, Karachi., Karachi, Sindh, Pakistan;tel: 0321-2043624",
    "CITY": "Karachi",
    "FocusArea": "We started working from the home with a team of two by doing work for our client from United State, he was referred to us by some personal link. Later, in 2015 we initiated AAlogics at IBA Center for Entrepreneurial Development (CED) with a little initial capital we had earned through previous work. We secured many international as well as local clients and developing ecommerce sol"
  },
  {
    "Name": "2B Technologies",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.2bt.com.pk",
    "location": "Suite 1310 & 1311, 13th Floor, National IT Park Caesar's Towers, Shahrah-e-Faisal, Karachi, Sindh, Pakistan;(9221) 111-111-228",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "22 Four",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.22four.com",
    "location": "22 four 6-B Main Sunset Blvd, D.H.A. Phase 2, Karachi, Sindh, Pakistan;0334-6268644",
    "CITY": "Karachi",
    "FocusArea": "“22FOUR is.. where creative ideas meet unique execution to generate smart solutions”. We are a leading digital agency. Our solutions help our customer to think digital and create innovation. We are committed enabling businesses and brands with technology acceleration to leave a permanent impression on web, digital and mobile platforms."
  },
  {
    "Name": "A J Ventures (SMC-Pvt) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.iwant.pk",
    "location": "100 Shahrah-e-Faisal Service Road North, Karachi, Sindh, Pakistan;021 34370141",
    "CITY": "Karachi",
    "FocusArea": "Are you planning to start a new business but do not have enough investment for marketing? Are you looking for a talented writer but do not know where to find one? Do you need a highly skilled team for your business projects?"
  },
  {
    "Name": "A2Z Creatorz",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.a2zcreatorz.com",
    "location": "C-1, Mezzanine Floor, Sunset Lane # 3, Phase II Ext. DHA, Karachi, Sindh, Pakistan;(9221) 021-5385205-7, 0300-8277718",
    "CITY": "Karachi",
    "FocusArea": "A2Z Creatorz is one of the leading Web Services providers in their region since last 10 years. Since its establishment in June 2007; A2Z Creatorz has entered into various National, International, and Government based ventures and completed them successfully."
  },
  {
    "Name": "Abtach Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.abtach.com",
    "location": "Khaliq-uz-Zaman Road, Karachi, Sindh, Pakistan;021-32462414",
    "CITY": "Karachi",
    "FocusArea": "ABTACH Ltd. is a growing IT Company that has been established since 2014. Years of experience has enabled our company and its people to master the art of digital marketing. Our workplaces in USA, China, Pakistan, UAE and South Korea are full of competent individuals who are genuinely committed to help our company prosper all over the globe. Our cooperative and well-learned leaders are the driving force behind the company’s success. It is, thus, our people and their intellect that has made it p"
  },
  {
    "Name": "Accountancy Outsourcing Services Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.aoserv.com",
    "location": "4 Egerton Road, Lahore, Punjab, Pakistan;042-36316384",
    "CITY": "Lahore",
    "FocusArea": "The Business Process Outsourcing model is based on understanding the client needs. Systems, training and communication are the key to successful BPO. AOS has worked with two major European clients, Ascot Drummond and Giant Group, to successfully deliver the outsourcing services in the complex accountancy arena."
  },
  {
    "Name": "4S Global (Pvt.) Ltd",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.4sglobal.com.pk",
    "location": "2 Street 3, Islamabad, Islamabad Capital Territory, Pakistan;null",
    "CITY": "Islamabad",
    "FocusArea": "We pride ourselves in meticulously planning the best for our clients; offering solutions like Oracle cloud, Big Data, Platform & Software migrations, backup high availability and DR services based on best practices yet practicable; we take responsibility of leading our clients all along the path to success."
  },
  {
    "Name": "AA Intelligent Systems",
    "Rate": "",
    "Employee": "",
    "Founded": "29-Nov-19",
    "Website": "http://www.aaisystems.com",
    "location": "245-2-Y, Block 6 P.E.C.H.S., Karachi, Sindh, Pakistan 74600;#ERROR!",
    "CITY": "Karachi",
    "FocusArea": "The last decade has seen a revolutionary change in how business processes can be improved and more tightly integrated using new technologies. Unfortunately, most of the available solutions require that systems currently deployed by organizations be completely replaced to take advantage of these new technologies. Additionally, the business processes and practices a software solution was based on might not be compatible with all organizations. Each organization has its own specific set of requirem"
  },
  {
    "Name": "Access Group (E-Access) (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.access.net.pk",
    "location": "Railway Road, Karachi, Sindh, Pakistan;(92 21) 111-111-974",
    "CITY": "Karachi",
    "FocusArea": "Over the years, Access Group has built up one of the largest nationwide support network for servicing its customers spanning over 200 cities, towns and villages across Pakistan."
  },
  {
    "Name": "7Vals",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.7vals.com",
    "location": "264 CCA FF Block DHA, Lahore, Punjab, Pakistan;042-36162595",
    "CITY": "Lahore",
    "FocusArea": "All the easy problems have been solved already. We’re here to build on them. We enable businesses to accelerate workflows by focusing on their strengths. 7Vals is global, with customers from over 20% of Fortune 500 companies. Nurturing employees and refining their skillset makes us better every day."
  },
  {
    "Name": "3SC Technologies (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.3scworld.com",
    "location": "Office # 311 3rd floor ISE tower Blue Area, Islamabad, Islamabad Capital Territory, Pakistan;null",
    "CITY": "Islamabad",
    "FocusArea": "3SC World is the culmination of 20 years of business success providing services such as technology solutions, consultancy, project management and supply chain management which includes procurement and logistical support on an International level.3SC World is a company built on the synergies of expertise, experience and hard work, which inevitably lead to successful projects and satisfied clientele."
  },
  {
    "Name": "1 To N (Pvt.) Ltd",
    "Rate": "",
    "Employee": "",
    "Founded": "4-Jan-11",
    "Website": "http://1-to-n.com",
    "location": "House # 1-B, Al-Meher Colony, E-11, Islamabad, Islamabad Capital Territory, Pakistan 46000;92518732143",
    "CITY": "Islamabad",
    "FocusArea": "1 To N Pvt. Ltd. is provider of customized and prepackaged software solutions on multiple platforms such as desktop, web based or on mobile devices. We specialize in business process automation. Currently, we offer prepackaged products in the domain of accounts and finance, information systems, mobile applications, web development and gaming."
  },
  {
    "Name": "1ST 4 CONNECT (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://1st4connect.com",
    "location": "3 Danepur Road, Lahore, Punjab, Pakistan;tel: +92-42-35408292",
    "CITY": "Lahore",
    "FocusArea": "Our mission is to be the leading company in our designated services areas, providing our clients with high-quality, reliable, exceptional and efficient services, with excellent support. We aim to provide an unparalleled working environment for our employees and to generate sufficient earnings to run the company smoothly and provide predictable returns to our shareholders."
  },
  {
    "Name": "360 Technologies (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.360technologies.net",
    "location": "A.K. Fazl-ul-Haq Road, Islamabad, Islamabad Capital Territory, Pakistan;#ERROR!",
    "CITY": "Islamabad",
    "FocusArea": "360 Technologies is a chartered company, with focus on delivering technology based solutions to companies around the globe. 360 professionals along with alliance partners provide an unmatched level of domain expertise with a result-oriented approach. The company delivers business value using IT to empower organizations with innovative and scalable technology solutions that increase their competitive advantage and return on investment. Capitalizing on profound industry experiences, extensive tech"
  },
  {
    "Name": "ABM INFO TECH (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.abmgroup.com",
    "location": "Shaheed Chaudary Aslam Road, Karachi, Sindh, Pakistan;(9221) 5654981-5",
    "CITY": "Karachi",
    "FocusArea": "ABM Group of Companies is one of the strongest Business Houses in the country with business presence in Karachi, Lahore, Islamabad, Dubai and Uzbekistan. Some of our core businesses are:"
  },
  {
    "Name": "3Techno Digital (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://3techno.com/",
    "location": "Suite 203, Windsong Palace, Karachi, Sindh, Pakistan;0332-3392172",
    "CITY": "Karachi",
    "FocusArea": "As an end-to-end digital service agency, 3Techno facilitates businesses and brands to achieve their digital milestones. Our profound, consolidated approach to business solutions is backed by our intimate knowledge and understanding of the digital landscape. This certainly comes in handy for creating opportunities in places most digital agencies can’t fathom!"
  },
  {
    "Name": "A2Z E-Payments (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.a2zepayments.com",
    "location": "A2Z E-Payments, -7 (Basement) , Deans Trade Center , Saddar Road, Peshawar, Khyber Pakhtunkhwa, Pakistan;091-111441441, 091-5250315-7",
    "CITY": "Peshawer",
    "FocusArea": "Founded in 2006, A2Z Electronic-Payments private limited is a registered company with Security Exchange Commission of Pakistan (SECP). We pledge to follow a basic viewpoint to keep our high quality services simple, on time and smart. We facilitate and provide users friendly solutions in public & private sector by executing the accurate concept of Information Technology (IT). The systems provided by us are efficient, transparent, and secure with stock control, sales tracking, audit trials and"
  },
  {
    "Name": "110 Solutions",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.110solutions.com.au",
    "location": "87 타리크 로드, Karachi, Sindh, Pakistan;(9221) 4327478-79",
    "CITY": "Karachi",
    "FocusArea": "We fabricate stable long-haul associations with our customers. This allows our continuous development and improvement of our client’s business processes. A significant added value in performing IT projects is a permanent extension of expertise in the area of our core specialties: telecoms, media, finance and the public sector."
  },
  {
    "Name": "Ahead Host",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "https://www.aheadhostllc.com",
    "location": "Unnamed Road, Hyderabad, Sindh, Pakistan;0335-2502935",
    "CITY": "",
    "FocusArea": "Shared hosting is hosting for those people who have small traffic or small websites. Shared hosting provides multiple hosting at a time on a single server. It is used for those people who can’t pay a large amount like dedicated hosting. It is comparatively slower than the dedicated hosting because multiple websites are getting the traffic from the single server."
  },
  {
    "Name": "Adsells Advertising (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://adsells.biz",
    "location": "Street 1, Lahore, Punjab, Pakistan;tel: 04234235140790-2",
    "CITY": "Lahore",
    "FocusArea": "Adsells, a flagship advertising company, epitomizes in innovative branding solutions. Sixty-five years of professional pedigree has placed Adsells at the Vanguard of the industry. We are offering various solutions to a roster"
  },
  {
    "Name": "AI Management Services (AIMS)",
    "Rate": "",
    "Employee": "",
    "Founded": "9-Feb-17",
    "Website": "http://www.aimanagement.tech",
    "location": "Office#1, Plot#2, F-8 Markaz, Islamabad, Islamabad Capital Territory, Pakistan 46000;512287215",
    "CITY": "Islamabad",
    "FocusArea": "AIMS is a professional and trusted IT solutions company dedicated to providing exceptional service to businesses in Pakistan and MENA region. We work with organisations of every size and from every sector."
  },
  {
    "Name": "AJ Software (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.creditobjects.com.au",
    "location": "Ghalib Road, Lahore, Punjab, Pakistan;tel: 03363331144",
    "CITY": "Lahore",
    "FocusArea": "Credit Objects PTY LTD takes pride in developing state of the art software solutions based on Web 2.0 technologies for businesses that operate in the asset finance industry."
  },
  {
    "Name": "Advanced Communications",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.advcomm.net",
    "location": "Dhok Mustaqeem Road, Rawalpindi, Punjab, Pakistan;(92 51) 2213248",
    "CITY": "Rawalpimdi",
    "FocusArea": "We usually provide the seed funding ourselves to bring the concept to reality. When the value proposition is more visible, we find venture capitalists and angel investors. We have deep rooted existing contacts with these people and we are continuously improving them for future"
  },
  {
    "Name": "Acrux Technologies (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.acruxtek.com",
    "location": "201 Street 18, Islamabad, Islamabad Capital Territory, Pakistan;tel: +92 51 844 8772",
    "CITY": "Islamabad",
    "FocusArea": "Acrux Technologies has ventured into a number of conventional and non-conventional areas ranging from Software Development, ICT Consulting, Internet of Things, Airport Technologies, Trade Facilitation, Business Process Analysis, Data Analytics, Strategic and Tactical Planning, Multi Weapons Simulator, Facial Recognition, Security and Surveillance."
  },
  {
    "Name": "Advanced Research Projects and Technologies (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.arpatech.com",
    "location": "C28/B 24th Commercial Street, Karachi, Sindh, Pakistan;021-5377491-4",
    "CITY": "Karachi",
    "FocusArea": "We started in 2003 as a classic information technology service provider with the aim of delivering business solutions to customers worldwide. Today, we are stretched across four continents with offices and customers in US, UK, UAE and Pakistan."
  },
  {
    "Name": "Aga Khan University Hospital",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.aku.edu",
    "location": "Unnamed Road, Karachi, Sindh, Pakistan;92-21-493-0051",
    "CITY": "Karachi",
    "FocusArea": "Aga Khan University is a unique hybrid: an institution of academic excellence that is also an agent for social development. A leading source of medical, nursing and teacher education ,research and public service in the developing world, the University prepares men and women to lead change in their societies and to thrive in the global economy."
  },
  {
    "Name": "Agilitize (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.agilitize.org",
    "location": "1 Canal Bank Service Road, Lahore, Punjab, Pakistan;tel: +923028288963",
    "CITY": "Lahore",
    "FocusArea": "Agilitize is a technology firm focused on developing integrated business solutions and pioneering Health Care applications. Our philosophy is to create agility in work flows to provide impactful solutions for the client, reinvigorating the value chain from end to end. With a multi-pronged focus, we have stepped out to provide our expertise to corporations, family-owned businesses, state-owned enterprises and non-governmental organizations."
  },
  {
    "Name": "Aciano",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.aciano.net",
    "location": "D40/1 block L North Nazimabad, Karachi, Sindh, Pakistan;0333-3233471",
    "CITY": "Karachi",
    "FocusArea": "Aciano Technologies specializes in software development, implementation and system integration. Our expertise lies in providing solutions as per customer requirements. Our consultants work closely with customers to understand their problem statement and provide solutions best suited for their respective environment. All our customers whether entrepreneur or established businesses are extremely valued and their needs are catered. We are experts in Magento, Microsoft Dynamics, Sage 300, WordPress,"
  },
  {
    "Name": "Aekpani Networks",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.aekpani.net",
    "location": "Shaheed-e-Millat Expressway, Karachi, Sindh, Pakistan;021-34398741",
    "CITY": "Karachi",
    "FocusArea": "With representation in Pakistan, UK, Bahrain and Kuwait, Aekpani Networks is a dynamic international organization devoted to serving its customers. We are a team of strategists, designers, developers and IT technologists who help transform your bricks and mortar business into digital organisations. We are leaders in IT and digital innovation helping clients capture new opportunities without worrying about digital security threats."
  },
  {
    "Name": "Alchemy Technologies (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.alchemya.com",
    "location": "166 Block 7/8, KMCHS, Karachi, Sindh, Pakistan;(92-21) 4556431; 4544745",
    "CITY": "Karachi",
    "FocusArea": "Created by a team of risk professionals with the objective of helping people learn, understand and apply quantitative and computational finance tools. For many years, we looked for a resource that we could use for training our new team members within the domain of risk management. This site is the public face of that internal tool used to train clients and employees on advance topics in computational and quantitative finance."
  },
  {
    "Name": "Alfoze Technologies (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.alfoze.com",
    "location": "Unnamed Road, Islamabad, Islamabad Capital Territory, Pakistan;null",
    "CITY": "Islamabad",
    "FocusArea": "To be considered a trusted partner in Connected World. We are working to enrich Social & Technology experience of people, society and markets"
  },
  {
    "Name": "AKSA Solutions Development Services (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": "27-Jun-00",
    "Website": "http://www.aksa-sds.com",
    "location": "Plot # 359, Street # 05, I-9/3, Islamabad, Islamabad Capital Territory, Pakistan 46000;(9251) 2828176, 2827582-3",
    "CITY": "Islamabad",
    "FocusArea": "A leading technology company that provides reliable and trusted next-generation hardware and software solutions using the latest innovative technologies."
  },
  {
    "Name": "AdamSoft International (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.adamsoftintl.com",
    "location": "4 Egerton Road, Lahore, Punjab, Pakistan;(9242) 6317246-8",
    "CITY": "Lahore",
    "FocusArea": "Our leadership and technical teams have been carefully selected and share a wealth of experience. Our design team has a history of demonstrated technical results, recognized education and certification milestones acclaimed internationally. What does this mean to you? Our teams have the business savvy, training, and expertise to stay focused on your success. AdamSoft solution design teams combine the top talent available in"
  },
  {
    "Name": "Al-Rehman Technologies",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.Al-Rehman.com",
    "location": "Shahrah-e-Faisal Road, Karachi, Sindh, Pakistan;8525970-1, 2782272-3",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Algorithm Consulting (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.algorithm.com.pk",
    "location": "Eidgah Road, Karachi, Sindh, Pakistan;021 5090954-6",
    "CITY": "Karachi",
    "FocusArea": "AlgoERP is extremely adaptable to the needs of the manufacturers of Apparel and Home Textile products. AlgoERP provides a comprehensive set of Modules specially designed for the Apparel & Textile’s Make-to-Order manufacturing environment. All business divisions and systems can now work together and give you the ability to unify and streamline every aspect of your enterprise. <span class=\"P-2_Heading"
  },
  {
    "Name": "AGCN Pakistan (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.agcnpakistan.com",
    "location": "172 Tufail Road, Lahore, Punjab, Pakistan;null",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Acrologix (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.acrologix.com",
    "location": "286-FF, Phase 4, DHA, Lahore, Punjab, Pakistan;(9242) 6617401-3",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Advanced Financial Application (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.afapplic",
    "location": "16-C, Lane 2, Rahat Commercial Area Phase 6, D.H.A, , PK;(9221) 5843259; 584-4378",
    "CITY": "",
    "FocusArea": null
  },
  {
    "Name": "Apvision (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.apvision.com.pk",
    "location": "D-5, Block 7, Gulshan - e- Iqbal, Karachi, Sindh, Pakistan;021-8583408",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "AMZ Access (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.amzaccess.com",
    "location": "Doctor Ziauddin Ahmed Road, Karachi, Sindh, Pakistan;(9221) 2219761; 111-269-111",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "AMID Tech",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.amid.tech/",
    "location": "265 Sarwar Shaheed Road, Karachi, Sindh, Pakistan;021-35211703",
    "CITY": "Karachi",
    "FocusArea": "A link of science enthusiasts, business practitioners and everyday native humans, rendering Business System Development Services. At Amid Tech, human experience is the core to strategic software development where knowledge, time and skill are integrated to transform digital experience. By combining the tech with your understanding of your customers and your business, we deliver solutions and experiences that drive commercial value for you."
  },
  {
    "Name": "ANA Soft",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "No. 12, St. 30, F-6/1 , Islamabad, Islamabad Capital Territory, Pakistan;(9251) 2827702",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "Appricot Studio",
    "Rate": "",
    "Employee": "",
    "Founded": "7-Dec-16",
    "Website": "http://www.appricotstudio.com",
    "location": "Office 808, Al-Qadeer Heights, New Garden Town, Lahore, Punjab, Pakistan 54000;tel: 924238102116",
    "CITY": "Lahore",
    "FocusArea": "Unlike traditional services approach, our selective project focus has made us subject matter experts. We not only create technology solutions, but guide you with:"
  },
  {
    "Name": "Alt Source Communications",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "40-C Block 6 P.E.C.H.S, Karachi, Sindh, Pakistan;4541960-7",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "ApoyoTech",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.apoyotech.com.pk",
    "location": "Agha Khan Road, Islamabad, Islamabad Capital Territory, Pakistan;0334-5655598",
    "CITY": "Islamabad",
    "FocusArea": "Apoyo Tech is one of the fastest growing BPO solutions provider and a leading exporter of IT services from Pakistan. With an exponential growth rate and a current resource pool of highly qualified and trained personnel, Apoyo Tech offers award winning global services with 24/7 support for all its clients through best of breed IT Infrastructure and support function and 2 fully redundant facilities."
  },
  {
    "Name": "ArhamSoft (Pvt) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": "1-Jan-07",
    "Website": "https://www.arhamsoft.com/",
    "location": "17 - N, Main Blvd, Johar Town, Lahore, Punjab, Pakistan 54000;0345 9666526",
    "CITY": "Lahore",
    "FocusArea": "Arhamsoft (Pvt) Ltd is an entrepreneurial success story of Mr. Irfan Zafar and his progressive approach toward IT industry in Pakistan. As a premium web development company, we globally deliver exclusive software solutions and white label products beyond compare. We are fortunate to have skilled and professionally growing 150+ IT personnel on board. Today, we are outsourcing managed IT services."
  },
  {
    "Name": "Arbisoft (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "Arbisoft Private Limited, 25 Westwood Colony Thokar Niaz Baig opposite Metro Gate Canal Side Lahore, Lahore, Punjab, Pakistan;null",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "APEX Consulting Pakistan",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.apexconsulting.biz",
    "location": "61-A Nazim-ud-din Road, Islamabad, Islamabad Capital Territory, Pakistan;052-2800397 ext: 3110",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "ARITTEK",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.arittek.com",
    "location": "OFFICE 2 FLOOR 3RD BUILDING 34C LANE 4 KHAYABAN-E-SHAHBAZ DHA PHASE VI, Karachi, Sindh, Pakistan;tel: 00922135172415",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Allainet (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.allainet.com",
    "location": "Murree Rd, Rawalpindi, Punjab, Pakistan;tel: 051-4573225 - 4573226",
    "CITY": "Rawalpimdi",
    "FocusArea": "With each assignment, our clients entrust their business challenges to us. And with each launch, we find the unique opportunity that lies within. All our business practices are structured to dig deep into the needs of our clients and develop a solution that captures market share. With every venture we become stronger, faster and take the scalability to a whole new level. We do not provide cheap solutions; we provide value with timely and measurable return on investment.."
  },
  {
    "Name": "AppsGenii Technologies (Pvt) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": "22-Nov-19",
    "Website": "https://www.appsgenii.com/about-us/",
    "location": "16-S, 1st Floor, Imperial Garden، Paragon City, Barki Road Lahore, Pakistan, Lahore, Punjab, Pakistan 54000;042-38905440",
    "CITY": "Lahore",
    "FocusArea": "AppsGenii Technologies enable clients to out perform the competition and stay ahead of the innovation curve. Our business experiences are real and so are the results that we bring to our clients. We are always in search of exploring new frontiers for clients to transform their businesses, their thinking and their end results."
  },
  {
    "Name": "Alp Business Service Management (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.alp-bsm.com",
    "location": "243 Street 9, Lahore, Punjab, Pakistan;(9242) 6625261-2",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Amaana (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.amaana.com",
    "location": "70-C-1, Gulberg-III, Lahore, Punjab, Pakistan;(9242) 5875494",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "AppsGenii",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.appsgenii.com",
    "location": "Tufail Shaheed Road, Karachi, Sindh, Pakistan;tel: +92 321 6443388",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Algotrek Technology Consulting",
    "Rate": "",
    "Employee": "",
    "Founded": "29-Nov-19",
    "Website": "http://www.algotrek.com",
    "location": "7 Tariq Road, Karachi, Sindh, Pakistan 74600;021 34321115",
    "CITY": "Karachi",
    "FocusArea": "Algotrek is an engineering spinoff of Align Technology – a multibillion dollar medical devices firm. Our core team has experience in setting up 2 Silicon Valley startups, developing for the IBM/EPFL Blue Brain project, financial applications for Goldman Sachs and developing a diverse set of mobile and web applications."
  },
  {
    "Name": "AMOS Global (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.amos-global.com",
    "location": "23 Canal Road, Lahore, Punjab, Pakistan;(9242) 5884981-85",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Arco Data Services",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.arcodata.net",
    "location": "5 Mason Road, Lahore, Punjab, Pakistan;(9242) 6361952; 6301951",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Arcana Info (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "https://www.arcanainfo.com/",
    "location": "656, Street 41, Sector E-11/4, Islamabad, Islamabad, Islamabad Capital Territory, Pakistan;051-111-272-262",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "ATC Digital",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.atc.digital",
    "location": "12 Grant Road, Karachi, Sindh, Pakistan;0321 2013131",
    "CITY": "Karachi",
    "FocusArea": "ATC.Digital is a full-service technology startup that designs seamless user experiences, build robust web applications, provide business analytics solutions, manage cloud infrastructure and handle developer operations."
  },
  {
    "Name": "Assurety Consulting Pvt Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.assuretyconsulting.com",
    "location": "SUITE # 1107-1109, 11TH FLOOR, NATIONAL IT PARK, CAESARS TOWER, SHAHRAH-E-FAISAL, Karachi, Sindh, Pakistan;tel: 32803045",
    "CITY": "Karachi",
    "FocusArea": "The company culture at Assurety Consulting is built upon the principle that we truly believe in what we do – and all of our efforts are focused on promoting the best interests of the customers and industries we serve. We are industry leaders who effect change that positively impacts our customers’ bottom lines."
  },
  {
    "Name": "AT&T Global Network Services International, Inc. - Pakistan Branch",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://att.com",
    "location": "2nd Floor, Nice Trade Orbit Building, PECHS Block 6, Shahrah-e-Faisal, Karachi, Sindh, Pakistan;tel: +92-21-3432-9650",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Arthur Lawrence (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": "5-Feb-03",
    "Website": "http://www.arthurlawrence.net",
    "location": "F-45, PECHS, Block 6, Off. Shahra-e-Faisal, Hyderabad, Sindh, Pakistan 75400;92343 20310-4",
    "CITY": "",
    "FocusArea": "We are management and technology consultants providing enterprise-wide technology enablement, digital transformation, and other services that meet at the intersection of management and technology."
  },
  {
    "Name": "Arwen Tech (Private) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.arwentech.com",
    "location": "48 F /B, Block 6, P.E.C.H.S, Shahrah-e-Faisal, Karachi, Sindh, Pakistan;(9221) 4558322; 111 37 37 37",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Askoli",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.askoli.com",
    "location": "House No. 43 Street 35 F6/1, Islamabad, Islamabad Capital Territory, Pakistan;051 227 0354",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "ASK Development",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "House # 606, Street # 29, Islamabad, Islamabad Capital Territory, Pakistan;051-2110893-5",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "Astica (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://elastica.net",
    "location": "205 Second Floor Business Arcade 27/A Block 6 PECHS, Karachi, Sindh, Pakistan;4082307342",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Averox (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.averox.com",
    "location": "4 B Sumbal Road, Islamabad, Islamabad Capital Territory, Pakistan;(92 51) 2875737",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "AutoSoft Dynamics (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": "1-Dec-19",
    "Website": "http://www.autosoftdynamics.com",
    "location": "360/2, Q Commercial Area DHA, Lahore, Punjab, Pakistan, Lahore, Punjab, Pakistan 54000;(92 42) 3589 8282-6 Ext: 102, 103",
    "CITY": "Lahore",
    "FocusArea": "AutoSoft is a leading global financial automation solution provider based out of Pakistan. Our solutions are currently being used by leading banking and financial institutions in Pakistan as well as globally in Africa and the Middle East. In addition to high quality software solutions, our clients recognize us for providing dedicated implementation, training, customization and after sales support services for all our products."
  },
  {
    "Name": "AUA Solutions",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.auasolutions.com",
    "location": "Shahrah-e-Faisal Road, Karachi, Sindh, Pakistan;tel: 9221-34325134",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Ashtex Solutions",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "https://www.ashtexsolutions.com/",
    "location": "66 Ali Street, Lahore, Punjab, Pakistan;0336-7824235",
    "CITY": "Lahore",
    "FocusArea": "Ashtex Solutions is one of the emerging IT Solutions providers in Web / Mobile Development domains. We offer a wide range of services including Bu"
  },
  {
    "Name": "Astera Software Pakistan (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "https://www.astera.com/",
    "location": "Shahrah-e-Faisal Road, Karachi, Sindh, Pakistan;021-32783727",
    "CITY": "Karachi",
    "FocusArea": "Astera Software is a rapidly-growing provider of enterprise-ready data solutions. We help business users bridge the data-to-insight gap with our suite of user-friendly yet high-performance data extraction, data quality, data integration, data warehousing & electronic data interchange solutions, which are used by both midsize and Fortune 500 companies across a range of industries."
  },
  {
    "Name": "Arkhitech",
    "Rate": "",
    "Employee": "",
    "Founded": "1-Jan-15",
    "Website": "http://www.arkhitech.com",
    "location": "Plot no. 206, Service road (East), Sector I-10/3, Islamabad., Islamabad, Islamabad Capital Territory, Pakistan 46000;051-4858394",
    "CITY": "Islamabad",
    "FocusArea": "We design and develop elegant and functional solutions using Ruby on Rails, React, Node.js, Angular and more. We deliver apps essentials at your finger tips.Functional, flawless and easy to use. We are RoR experts, but building great products would not be possible without strong expertiese and extensive usage of many other technologies, e.g. Nginx, React/Angular,PostgreSQL, Redis, Redshift, AWS, Heroku and many others."
  },
  {
    "Name": "Aurelian Solutions",
    "Rate": "",
    "Employee": "",
    "Founded": "8-Feb-18",
    "Website": "https://aureliansolutions.com/",
    "location": "50، J2 Block Block Phase 2 Johr Town, Lahore, Lahore, Punjab, Pakistan 54000;042-35473720",
    "CITY": "Lahore",
    "FocusArea": "We make the Mightiest Mobile Games around! Web Design DOLORE MAGNA ALIQUA. UT ENIM AD MINIM VENIAM, QUIS NOSTRUD EXERCITATION ULLAMCO LABORIS NISI UT ALIQUIP."
  },
  {
    "Name": "Avanceon Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.iael.com",
    "location": "19 KM, Lahore, Punjab, Pakistan;(92) 042-111940940",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Askari Information Systems Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.ais-info.com",
    "location": "Agha Khan Road, Islamabad, Islamabad Capital Territory, Pakistan;(92 51) 9208991-3",
    "CITY": "Islamabad",
    "FocusArea": "Established in 1998, Askari Information Systems Limited (currently inoperative) is a progressive software development company with state-of-the-art paraphernalia and an impressive team of 50- plus brilliant, devoted and highly skilled IT Professionals who have successful experience of developing and implementing sophisticated system for a variety of organizations, both inland and abroad."
  },
  {
    "Name": "Avanza Solutions (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.avanzasolutions.com",
    "location": "Suite # 201, 2nd Floor, Karachi, Sindh, Pakistan;(9221) 5675240-42",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Avanza Premier Payment Services",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.apps.net.pk/",
    "location": "Shahrah-e-Liaquat, Karachi, Sindh, Pakistan;0300 9211102",
    "CITY": "Karachi",
    "FocusArea": "Avanza Premier Payment Services (Pvt.) Limited (APPS) is a company formed by the joint venture of Avanza Solutions and Premier Systems. APPS is registered with the Securities and Exchange Commission of Pakistan and has been incorporated under the Companies Ordinance 1984.APPS currently holds principle license of Payment System Operator/Payment System Provider from State Bank of Pakistan under PSO/PSP regulation, 2014. Payment system operators act as a bridge between consumers, merchants, and fin"
  },
  {
    "Name": "ART (AL Rehman Technologies)",
    "Rate": "",
    "Employee": "",
    "Founded": "1-Feb-17",
    "Website": "http://www.al-rehman.com",
    "location": "Suite No 112,113 Sea Breeze Plaza Karachi, Pakistan, Karachi, Sindh, Pakistan 74600;-2690062",
    "CITY": "Karachi",
    "FocusArea": "ART, a full service digital agency in Pakistan, engages itself in building only what is possible of our elastic thinking. By creating the most imaginative solutions, we help our partners move from concept to initiation. We combine brilliant imaginations to form a collision, so that it can be transformed to an incredible solution."
  },
  {
    "Name": "Beyond Information Tecnology Solutions",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.bitsonline.net",
    "location": "5-6/C, Khayaban-Ittehad, Karachi, Sindh, Pakistan;(9221) 5805531-32",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "BestHive Pakistan",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.besthive.com",
    "location": "Room # 209, 2nd Floor, Anum Empire, Plot ZCC-1, Block - 7/8, K.C.H.S. Main Shahrah-e-Faisal, Karachi, Sindh, Pakistan;2134150595",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "BITLogix (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "https://ebitlogix.com/",
    "location": "46-B II, Main Gulberg, Lahore, Punjab, Pakistan;042 35781941 - 42",
    "CITY": "Lahore",
    "FocusArea": "BITLogix (Pvt.) Ltd. is one of the leading business consultancy and technology enterprises of Pakistan and was incorporated under Companies Ordinance 1984 in 2003. We specialize in business consultancy and enterprise level information technology solutions. Since its inception, BITLogix’s services have empowered businesses to best optimize their return on investment which is critical to their success in today’s competitive business environment."
  },
  {
    "Name": "Bari's Technology Solution",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://Baritechsol.com",
    "location": "Suite 502, Progressive Center, Shahrah-e-Faisal., Karachi, Sindh, Pakistan;null",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Azcorp Entertainment (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.azcorpentertainment.com",
    "location": "1st Zamzama Lane, Karachi, Sindh, Pakistan;021-35244202",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "AZM Computer Services (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.azm.com.pk",
    "location": "21 Ferozepur Road, Lahore, Punjab, Pakistan;(9242) 7552269",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "BITS Software House",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.bitspk.com",
    "location": "A-359, Block 5, Gulshan-e-Iqbal, Karachi, Sindh, Pakistan;(9221)4219908, 8420967",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Bitsol Technologies",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "https://bitsol.tech/",
    "location": "Service Road North, Islamabad, Islamabad Capital Territory, Pakistan;051-8739512",
    "CITY": "Islamabad",
    "FocusArea": "bitSol Technologies is a software development outsourcing company focusing on IT consulting and offshore programming services with team having years of experience in mobile and web application development and delivering state of the art computer software solution. Our professional team has in-depth expertise in such key technologies as Java, PHP, .Net as well as profound knowledge of iOS, and Android. bitSol Technologies tech-savvy specialists have successfully delivered many web and mobile proj"
  },
  {
    "Name": "Basecamp IT Solutions",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.basecampit.com",
    "location": "Foujdari Road, Hyderabad, Sindh, Pakistan;tel: +92-22-2614537",
    "CITY": "Hyderabad",
    "FocusArea": "We’re a Pakistani offshore software development resource center. With over 12 years in business & hundreds of software engineers, developers, UI/UX designers and software project managers, we are working with several startups, software product development companies, digital agencies and enterprises across the globe to help simplify their outsourcing experience and reduce costs/time-to-market."
  },
  {
    "Name": "Ayesoft",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.ayesoft.com",
    "location": "270 Street 37, Islamabad, Islamabad Capital Territory, Pakistan;0092-51-2856713",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "Bearing Point",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.bearingpoint.com",
    "location": "10th Floor, NIC Building, Karachi, Sindh, Pakistan;(9221) 563-5401-7; 111-000-221",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Bite IT Consultants",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.biteitconsultants.com",
    "location": "Al-Asar Center 402, Karachi, Sindh, Pakistan;(9221)5416558",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Awami Systems Technologies (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://ast.com.pk",
    "location": "8 Markaz Road, Islamabad, Islamabad Capital Territory, Pakistan;tel: 051-8448730",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "BesTel Communications (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": "1-Feb-03",
    "Website": "http://www.bestel.com.pk",
    "location": "D1 Sea Breeze Apartments Sher Shah Block, New Garden Town Lahore 54000, Pakistan, Lahore, Punjab, Pakistan 54000;#ERROR!",
    "CITY": "Lahore",
    "FocusArea": "BesTel was established in 2004 to provide system integration and end to end IT, software and telecom solutions to SME, government, and private sector organizations."
  },
  {
    "Name": "Bahria Enterprise Systems & Technologies (BEST)",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.best-bf.com",
    "location": "6th Floor, Bahria Complex - II, Karachi, Sindh, Pakistan;021-35610813",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Binex Solutions (Pvt) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": "1-Sep-09",
    "Website": "http://www.binexsolutions.com",
    "location": "Lower ground floor, Block A, STP I-9/3, Islamabad, Islamabad Capital Territory, Pakistan;#ERROR!",
    "CITY": "Islamabad",
    "FocusArea": "A high-end professional software development services company, well known for developing mobile apps and games."
  },
  {
    "Name": "B Solutions",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.bsolutions.pk",
    "location": "Shabbir Sharif Road, Lahore, Punjab, Pakistan;0423 570 9916",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Bentley Systems Pakistan (Pvt) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.abentley.com",
    "location": "307 Evacuee Trust Complex, Islamabad, Islamabad Capital Territory, Pakistan;051-2872639",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "Barrett Hodgson ITSolutions Pakistan (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.bh-itsolutions.com",
    "location": "F/423, Karachi, Sindh, Pakistan;(9221) 257 0651-7, 256 8810-20",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Bespoke Global Solutions",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.besglosol.com",
    "location": "60 BMCHS Road No. 4, Karachi, Sindh, Pakistan;0333-1222593",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Bramerz Private Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://bramerz.pk",
    "location": "116 CCA, Block DD, Phase 4, DHA, Lahore, Punjab, Pakistan;042 37060558",
    "CITY": "Lahore",
    "FocusArea": "Established in 2006, Bramerz is considered to be one of the leading digital agencies of Pakistan and with a team of 100+, there is immense experience working on products, projects & campaigns of varied domains & sizes. Our founders come with a diverse background of working at companies like Google, Facebook, Twitter, ASUS, Red Bull, Akzo Nobel and are considered to be the thought leaders in their domains and along with other key members of our team talk frequently at various conferences"
  },
  {
    "Name": "Braintree Group",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.braintreegrp.com",
    "location": "House 14-A, Street 2, Islamabad, Islamabad Capital Territory, Pakistan;(9251) 2823250",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "C Square Consulting (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://csquare.co",
    "location": "Suite 303, Anum Empire Building, Karachi, Sindh, Pakistan;#ERROR!",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "BroadPeak Technologies",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.broadpeak.com",
    "location": "2nd Floor, Time Square Building, I-8 Markaz, Islamabad, Islamabad Capital Territory, Pakistan;tel: +92 51 4938216 - 17",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "Business Beam (Pvt.) Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.businessbeam.com",
    "location": "511, Park Avenue, Block 6, P.E.C.H.S., Karachi, Sindh, Pakistan;#ERROR!",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Brain Telecommunication Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.brain.pk",
    "location": "730 Nizam Block Allama Iqbal Town, Lahore, Punjab, Pakistan;tel: +92422100000",
    "CITY": "Lahore",
    "FocusArea": "A department of Brain Telecommunication Limited, dedicated to design enterprise turn key solutions to fulfill internet needs of corporate sector. Brain Corporate was formed in year 2001 to manage and fulfill the growing IT needs. We design, innovate, create awareness, introduce & implement internetworking solutions and provide support through trained corporate support team."
  },
  {
    "Name": "Broad Peak Consultants (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.broadpeak.co/",
    "location": "1D-203 Main Korangi Industrial Road, Karachi, Sindh, Pakistan;9.22E+12",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Blue Zorro (Pvt) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.bluezorro.com",
    "location": "Suite No. 1003, Park Avenue, P.E.C.H.S, Block-6, Karachi, Sindh, Pakistan;tel: 021 34313715-17",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Business Technologies (Pvt.) Ltd",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "6 E, Block H, Gulber II, Lahore, Punjab, Pakistan;042-111-111-305",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Blue Ice Technologies",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.blueicetechnologies.com",
    "location": "16-C, Lane-2, Rahat Commercial Area, Karachi, Sindh, Pakistan;(9221) 584.4738",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Brain Logix",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://brainlogix.com",
    "location": "43-C1 Main Market Gulberg 2 Lahore, Lahore, Punjab, Pakistan;tel: 042-35787989",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Brickclay",
    "Rate": "",
    "Employee": "",
    "Founded": "1-Dec-14",
    "Website": "http://www.brickclay.com",
    "location": "Suite 112 - 115 2nd Floor Kohinoor One Plaza Jaranwala Road, Faisalabad, Punjab, Pakistan 38000;92418501688",
    "CITY": "Faisalabad",
    "FocusArea": "Brickclay provides B2B professional services to its clients by consuming data from ERP systems, big data systems, cloud systems, social media and IoT devices thus offering Data Insights and Analytics by using latest tools, technologies, and techniques of AI, data science, and data mining. This enables an entity to monitor its KPIs to make executive decisions in a timely manner at different organizational levels which empower continuous corporate growth."
  },
  {
    "Name": "Brisk Solutions (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": "1-Jan-05",
    "Website": "http://www.brisksol.com",
    "location": "office # 916, Al Hafeez Heights, Ghalib Road Gulberg III, Lahore, Punjab, Pakistan 54660;-4410609",
    "CITY": "Lahore",
    "FocusArea": "Brisk Solutions Pvt. Ltd. is an innovative IT solution provider to diverse types of businesses that empower them. We accelerate, simplify and enrich business processes to give our customers an edge over the competition. We provide comprehensive project life cycle services, from requirement analysis, design, application development, (EAI) Enterprise Application Integration, re-engineering, software consulting services, testing and maintenance."
  },
  {
    "Name": "BrainsSoft",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.brain.edu.pk",
    "location": "BSoft, BRAINS Degree College, Peshawar, Khyber Pakhtunkhwa, Pakistan;(9291) 9216993; 5843132",
    "CITY": "Peshawer",
    "FocusArea": null
  },
  {
    "Name": "BizSoft Technologies",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.bizsoftech.com",
    "location": "404-405 4th Floor, Century Tower, Gulberg Near Kalma Chowk, Lahore, Lahore, Punjab, Pakistan;null",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Call Biz",
    "Rate": "",
    "Employee": "",
    "Founded": "3-Oct-19",
    "Website": "http://www.callbiz.net",
    "location": "156- M Block Main Blvd Johar Town, Lahore, Punjab, Pakistan 54782;0300-5002333",
    "CITY": "Lahore",
    "FocusArea": "Call Biz is a creative development agency dedicated to driving new business to our clients. Our innovative approach allows us to partner with businesses to assist them in actualizing their niche in the market. By gaining a comprehensive understanding of the needs and goals of a business through organic communication, we gain the knowledge to tell their stories through their voices. Developing an online presence has increasingly become a key element for any successful business."
  },
  {
    "Name": "Brain Storm (Private) Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.brainstormworld.com",
    "location": "64-A Sector A-1, Township, Lahore 564770, Lahore, Punjab, Pakistan;(9242) 511 0308-09",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Business Solutions & Services",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://bssuniversal.com",
    "location": "NO 25, BLOCK B, VALANCIA TOWN, Lahore, Punjab, Pakistan;042-35210600",
    "CITY": "Lahore",
    "FocusArea": "Here at BSS, we promise our clients access to a talent pool where exceptionally skilled minds come together to leverage state-of-the-art software to help you to achieve your business objectives in innovative ways. Our engineers/personnel are specialized in delivering highly robust and scaleable mission-critical IT solutions using a swift delivery framework that focuses on SCRUM principles to reduce risk, optimize time and cut costs. With a wide-ranging base of satisfied global clients and prolif"
  },
  {
    "Name": "Buraq Integrated Solutions",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.buraq.com",
    "location": "12 D 6th Road, Rawalpindi, Punjab, Pakistan;(9251) 4840137-38",
    "CITY": "Rawalpimdi",
    "FocusArea": "Buraq Integrated Solutions (BIS) is dealing with Automatic Weather Stations (AWS), HMI/SCADA Solutions & Precision Agriculture"
  },
  {
    "Name": "Bitswits (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.bitswits.com",
    "location": "Suit # 1307, 13th. Floor, Caesars Tower, Shahrah-e-Faisal, Karachi., Karachi, Sindh, Pakistan;tel: 021-32785034",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Cinnova International",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.cinnova.com",
    "location": "24-A, Street No.1, Lahore, Punjab, Pakistan;0333-4692630",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "CATCOS, Inc.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.catcos.com",
    "location": "22-A, Block 7/8, Karachi, Sindh, Pakistan;-383.9291",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Click Chain",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.clickchain.com",
    "location": "8/C Street no. 6 Model Town A Bahawalpur, Bahawalpur, Punjab, Pakistan;tel: 923028689079",
    "CITY": "Bahawalpur",
    "FocusArea": null
  },
  {
    "Name": "Centegy Technologies (Private) Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.centegytechnologies.com/",
    "location": "2nd Floor Beaumont Plaza, Beaumont Road Karachi, Sindh, Pakistan Phone: (+92) (0)2135693541, Karachi, Sindh, Pakistan;Phone: (+92) (0)2135693541",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Chapal (Pvt.) Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.chapal.net",
    "location": "G-19/2, Khayaban-e-Jami, Block 9, Clifton, Karachi, Sindh, Pakistan;tel: +92 21 35839933",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Clarusoft (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.clarustech.com",
    "location": "National IT Park, 11th Floor , Karachi, Sindh, Pakistan;(9221) 278 8880-4",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "CC Technology",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.cctpak.com",
    "location": "D-68/1, Block 2, Karachi, Sindh, Pakistan;(9221) 111-810-810",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "CATALYST IT Solutions (Pvt) Ltd",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.catalyst.pk",
    "location": "403, 4th Floor, Al-Rehman Center, Karachi, Sindh, Pakistan;021-4316242,4316575",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Code District",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.codedistrict.com",
    "location": "Siddique Trade Center, Room 428, Lahore, Punjab, Pakistan;3214413040",
    "CITY": "Lahore",
    "FocusArea": "Develop powerful and highly usable custom software that solves your specific business problems, attracts users, and reinforces your brand. Web App <span style=\"font-size:"
  },
  {
    "Name": "Catalyst Interactive",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.catalyst-ct.com",
    "location": "Suite 1600, 16th Floor, Kashif Centre, Karachi, Sindh, Pakistan;5640015",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Centric Technologies",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.centrictech.com",
    "location": "Suite 819, Trade Tower, Karachi, Sindh, Pakistan;21-5223199",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Catco International, Inc",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.catcointernational.com",
    "location": "205, The Forum, Karachi, Sindh, Pakistan;(9221) 5361215",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Ciklum Pakistan (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.ciklum.net/",
    "location": "#2A,SECOND FLOOR,EVACUEE TRUST COMPLEX, Islamabad, Islamabad Capital Territory, Pakistan;051-2826114 , 2875414",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "Cloud BPO Private Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.cloubbpo.net",
    "location": "3rd Floor, 36-C, Bokhari Commercial, Karachi, Sindh, Pakistan;021-35245754, 35245742",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Channeltek Enterprise (Pvt.)Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.channeltek.com",
    "location": "96/2 11th Commercial Street, Karachi, Sindh, Pakistan;tel: 0092-21-111 567 111",
    "CITY": "Karachi",
    "FocusArea": "With ChannelTek, the client always comes first. The company has a razor sharp, focused ambition to improve on each and every one of its past project performances and thus is continuing to excel in beating its own expectations as well as those of its clients. ChannelTek is a multi-faceted organisation that is geared to offer consultancy and professional services in a spectrum of projects. Be it custom built facilities for large scale events and broadcast coverage, engineered systems integrations,"
  },
  {
    "Name": "Cloudcade Pakistan (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://cloudcade.com",
    "location": "Street 3, Lahore, Punjab, Pakistan;0321-4999669",
    "CITY": "Lahore",
    "FocusArea": "Cloudcade is a free-to-play mobile games developer and publisher. We were founded in 2014 with the vision of creating beautiful and innovative games with a global, mass market appeal. Our formula of superior user experience and metrics-driven design led to dramatic success with our initial title Shop Heroes. Through this and our international publishing expertise, Cloudcade has stayed ahead of the competition and reached millions of players around the world."
  },
  {
    "Name": "CARE (Center for Advanced Research in Engineering) Pvt. Ltd",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.carepvtltd.com",
    "location": "Plot no. 424, Service Road, I-9/3, Islamabad (Near I-9 Police Station), Islamabad, Islamabad Capital Territory, Pakistan;051-8432273",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "CloudLead",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.cloudlead.co",
    "location": "Suite # 213, 2nd Flr, Anum Blessings, Shara e Faisal, Karachi, Sindh, Pakistan;tel: 02134325094",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Cambridge Docs Pakistan (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.cambridgedocs.com",
    "location": "507, land Mark Plaza, Lahore, Punjab, Pakistan;(9242) 5878097-98",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Cheetay Logistics (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.cheetay.pk",
    "location": "33/S Faiz Ahmed Faiz Road, Lahore, Punjab, Pakistan;0342 4220000",
    "CITY": "Lahore",
    "FocusArea": "The land was barren, the feast was dry There weren’t even any kababs to fry"
  },
  {
    "Name": "Confiz Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.confiz.com",
    "location": "11-A, 3rd Floor, Leeds Center, Lahore, Punjab, Pakistan;(9242) 5783626",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Competitive Edge Digital",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.ce.digital",
    "location": "Suite No. 401 F2 Floor Jeff Hights Lahore Pakistan, Lahore, Punjab, Pakistan;tel: 042 35782555",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Computer Information Services (Private) Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.CispL.com",
    "location": "B-91 Muhammad Ali Cooperative Housing Society Main Tipu Sultan Road Karachi, Karachi, Sindh, Pakistan;tel: 34533312,34521329,34521379",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Consumer Facilitation Technologies (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.creditfix.pk",
    "location": "Service Road, Islamabad, Islamabad Capital Territory, Pakistan;tel: 03103335555",
    "CITY": "Islamabad",
    "FocusArea": "Easy Financing For Your Suppliers, Customers And Merchants"
  },
  {
    "Name": "Codistan (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.codistan.org",
    "location": "1865 C 12 Road, Islamabad, Islamabad Capital Territory, Pakistan;0347-4688154",
    "CITY": "Islamabad",
    "FocusArea": "We began how most companies begin, with sugar and spice and everything nice. We strived and we struggled and we built ourselves a castle made of sand. And like the saying goes, we know castles made of sand fall into sea if they’re not constantly kept in check. Believing in that, we work hard, day in day out to make this castle of ours taller and stronger. We believe in the value of hard work , dedication and determination and give no less than our maximum potential towards this dream we starte"
  },
  {
    "Name": "Codup.io",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://Codup.io",
    "location": "Shahrah-e-Faisal Road, Karachi, Sindh, Pakistan;0345-3152699",
    "CITY": "Karachi",
    "FocusArea": "We build software for “digital first” businesses. Our software deliver seamless user experiences and greater efficiencies, profit and growth.."
  },
  {
    "Name": "Connect 2Web (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.connect2web.com",
    "location": "C-194, KDA Scheme # 1-A, Karachi, Sindh, Pakistan;(9221) 4386185-6",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "CODE Informatics (Pvt) Ltd",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.codeinformatics.com/",
    "location": "House # 283, Street # 40, Sector F-10/4, Islamabad, Pakistan, Islamabad, Islamabad Capital Territory, Pakistan;tel: +92 51 8316898.",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "Computa",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.computa-it.com",
    "location": "1st Floor, Gulshan Palace, Block 13-C, Karachi, Sindh, Pakistan;(92-21) 4961018",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "COMMTEL",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.commtelsoft.com",
    "location": "F-50-A-1, Block-4, Karachi, Sindh, Pakistan;021 5822467",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Codility",
    "Rate": "",
    "Employee": "",
    "Founded": "12-Mar-18",
    "Website": "https://www.codility.co",
    "location": "7 C-1, Civic Center, Faisal Town, Lahore, Punjab, Pakistan 54700;4232089588",
    "CITY": "Lahore",
    "FocusArea": "Codility is a solution provider company based on cutting edge technologies. We provide comprehensive solutions in web and mobile application development. We value our clients and prioritize clients requirements. We are ready to deliver our best solutions and services in foresightful way with quality. A wide range of companies is offering the same services as we offer. They offer the same “What” & “How”, but our prestigious clients are always comfortable with our “Why” and “Who."
  },
  {
    "Name": "COMSATS Internet Services",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.comsats.net.pk",
    "location": "COMSATS Internet Services, CIS Technology Park Building 12, Shahrah-e-Jamhuriat, Sector G5/2, Islamabad Pakistan, UAN 111 700 800, tel: 051 9208063, Islamabad, Islamabad Capital Territory, Pakistan;tel: 051-111-700-800",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "Comcept (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.com-cept.com",
    "location": "Plot# 291, St. #3, Sector 3 Sector l-9/3, Industrial Area, Islamabad, Islamabad Capital Territory, Pakistan;(9251) 111 784 784",
    "CITY": "Islamabad",
    "FocusArea": "Incorporated in 1992, and ISO 9001-2000 certified, Comcept consists of a team of 150+ multi-disciplined professionals sharing diverse engineering exposure"
  },
  {
    "Name": "Conrad Labs (PVT) LTD.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.conradlabs.com",
    "location": "20 C-A, Gulberg II, Lahore, Punjab, Pakistan;4235876257",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Communications Network International",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.cni.almuash.com",
    "location": "6A, Mezzainie Floor, 25, Block-B, Huma Plaza, Fazlul Haq Road, Blue Area, Islamabad, Islamabad Capital Territory, Pakistan;(051) 2801024",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "Communication Square",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.communicationsquare.com",
    "location": "Shahrah-e-Jamhuriat, Islamabad, Islamabad Capital Territory, Pakistan;0321-5114425",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "Cogilent Solutions",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.cogilent.com",
    "location": "House # 11, Street # 38, Islamabad, Islamabad Capital Territory, Pakistan;(051) 287 1173; 0334-5511124",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "Computer Research (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.cr-pl.com",
    "location": "1218, 12th Floor, Caesar's Tower, Karachi, Sindh, Pakistan;(9221) 2790721-3; 4310506-8",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "CodesOrbit (prev Softak Solutions)",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "https://codesorbit.com/",
    "location": "Office # 2, 2nd Floor, Plot # 3, I&T Center, Street # 22, G8/4, Islamabad, Islamabad Capital Territory, Pakistan;#ERROR!",
    "CITY": "Islamabad",
    "FocusArea": "CodesOrbit is one of the fastest growing IT companies in Pakistan, We deliver a broad range of solutions and services across industries."
  },
  {
    "Name": "Code Enterprises (Pvt) Ltd",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.codenterprise.com",
    "location": "3rd Floor, MB City Mall, I-8 Markaz Islamabad, Islamabad, Islamabad Capital Territory, Pakistan;tel: 051-4862649",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "Crescent Solution",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "Suite No. 408, Business Avenue, 26-A, Karachi, Sindh, Pakistan;(9221) 4532991",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "CRYSTALLITE",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://crystal-lite.net/",
    "location": "Suit # 1206-1209, 12th Floor, Caesars Tower, Main Shahah-e-Faisal, Karachi, Karachi, Sindh, Pakistan;tel: 92 021 32803136",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Content Arcade",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.contentarcade.com",
    "location": "Office No 178-180, 2nd Floor, Regent Mall, Faisalabad, Punjab, Pakistan;0300 8669015",
    "CITY": "Faisalabad",
    "FocusArea": "Dedicated to adding value through technology, Content Arcade is not a new name when it comes to the IT industry. Our company has established itself as a reliable service provider that is progressive, dynamic, and people-friendly."
  },
  {
    "Name": "Corvit Networks (Pvt) Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.corvit.com",
    "location": "14-D/1, Ghalib Road, Lahore, Punjab, Pakistan;(9242) 5717567-8",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Crystal Systems (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "N.P 9/13, Ghulam Shah Street, Karachi, Sindh, Pakistan;(9221) 7524848",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "CresSoft",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "306, 3rd Floor, Siddiq Trade Centre, Lahore, Punjab, Pakistan;(9242) 5787592",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Creative Systems and Services",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "503 Japan Plaza, Karachi, Sindh, Pakistan;(9221) 7736601",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Creatrixe (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": "8-Feb-18",
    "Website": "http://www.creatrixe.com",
    "location": "3SC World Tower, Plaza 146, Mezzanine floor, Civic Center Bahria Town Phase 3, Rawalpindi, Punjab, Pakistan 46000;#ERROR!",
    "CITY": "Rawalpimdi",
    "FocusArea": "Creatrixe , delivers and manages a complete life cycle of classy web sites, breakthrough mobile applications, software development and expedient CRM solutions, to name a few. It currently operates globally with headquarters in Pakistan and in the US. Creatrixe operates as a Pvt, Ltd company in Pakistan and as an LLC in the United States and offers wide range of IT related services worldwide in diverse business domains."
  },
  {
    "Name": "Cooperative Computing",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.cooperativecomputing.com",
    "location": "M1-M2, Mezzanine Floor, Business Avenue, Shahrah-e-Faisal Karachi, Karachi, Sindh, Pakistan;tel: 021-34547001",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Cosmosoft Business Solutions Pvt Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.cosmosoftsolution.com",
    "location": "Office#8, Ross Residencia Plaza,1-new campus road canal bank, Johar Town, Lahore, Lahore, Punjab, Pakistan;042-35456003/35456007",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Cranium International",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "31-C-1, Ghalib Road, Lahore, Punjab, Pakistan;(9242) 6680787-9",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Creative Dots",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.creative-dots.com",
    "location": "55 Commercial Area, Lahore, Punjab, Pakistan;0300 8500089",
    "CITY": "Lahore",
    "FocusArea": "We are storytellers who are passionate about everything digital. Since we began life in 2013, we have embraced each milestone in digital marketing with profound zeal. From tried-and-tested strategies to cutting-edge technologies, we have delivered time and again, be it web design, e commerce online store, mobile app development or social media marketing."
  },
  {
    "Name": "Core2Plus",
    "Rate": "",
    "Employee": "",
    "Founded": "10-Feb-16",
    "Website": "http://core2plus.com/",
    "location": "Suite # 02, Mezzanine Floor, Siddique Chamber , FB Area Block 12, Gulberg, Karachi, Sindh, Pakistan 74600;#ERROR!",
    "CITY": "Karachi",
    "FocusArea": "Core2Plus provides comprehensive and integrated IT services that includes Software development, Website designing and development, Mobile application development, and implementation of mission critical business applications with cutting edge technology to our customers. At Core2Plus, we ensure you high quality deliveries every time and on time!"
  },
  {
    "Name": "Convsys (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.convsys.net",
    "location": "Suit # 202, Second Floor, Mumtaz Plaza, MPCHS, B-17, Islamabad, Islamabad Capital Territory, Pakistan;051-5203400",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "Contour Software (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://contour-software.com/",
    "location": "M-13 Bhittai Road, Islamabad, Islamabad Capital Territory, Pakistan;0300 8271006",
    "CITY": "Islamabad",
    "FocusArea": "Specialized Services – Application & UI/UX Modernization"
  },
  {
    "Name": "Contegris (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.contegris.com",
    "location": "114 Garden block, garden town, Lahore, Punjab, Pakistan;tel: 924232500999",
    "CITY": "Lahore",
    "FocusArea": "The world is transforming into a place where people and technology are bonded together, ever increasing demand for precision & efficiency in all the areas of life demands digitization, automation & cost effectiveness in every niche of life. Thus Innovative, unified and simple technology solutions are required by humans to make our lives better"
  },
  {
    "Name": "Creative Chaos Software Services Private Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.csquareonline.com/",
    "location": "2nd Floor Alkaram Center Plot BC-1 Block 7 Clifton.Karachi, Karachi, Sindh, Pakistan;tel: 0341-2087093",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Creative Chaos (Pvt) Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.csquareonline.com",
    "location": "2nd Floor, Al Karam Center, Karachi, Sindh, Pakistan;#ERROR!",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Crescent Technologies (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.cres-tech.com",
    "location": "104 Shadman-1, Lahore, Punjab, Pakistan;(9242) 7598301, 7572712, 7590586",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "d.o.t.z Technologies",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.dotztechnologies.com",
    "location": "57-c Street 11, Karachi, Sindh, Pakistan;#ERROR!",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "CureMD Pakistan (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.curemd.com",
    "location": "65 Main Blvd, Lahore, Punjab, Pakistan;(9242) 578-7500-2",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "DaleelTeq (Private) Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.daleelteq.com.pk",
    "location": "1st Floor, Building No: 11, D-Block, Rawalpindi, Punjab, Pakistan;-4580347",
    "CITY": "Rawalpimdi",
    "FocusArea": null
  },
  {
    "Name": "Cydea Tech (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": "1-Feb-19",
    "Website": "http://www.cydea.tech",
    "location": "Office#4, Lower Ground, Islamabad Corporate Centro, Golra Road, Islamabad., Islamabad Capital Territory, Pakistan 46000;051-8733471-2",
    "CITY": "Islamabad",
    "FocusArea": "Through extensive cutting-edge R&D, Cydea Tech rapidly brings to market, state of the art cyber security solutions to solve complex global enterprise challenges with ease."
  },
  {
    "Name": "Cubexs Weatherly (Pvt) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.cubexsweatherly.com",
    "location": "1st Floor, Federation House, Karachi, Sindh, Pakistan;(9221) 5877946-9; 111-282-397",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Cybarea Pvt Ltd",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://cybarea.com",
    "location": "302, 3rd floor, Shehnaz Arcade near Naheed Super Market, Shaheed e Millat Road, Karachi, Karachi, Sindh, Pakistan;021-3456344 0314-7732119",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Cybersoft Private Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "Wings Arcade 1-K Commercial K Block, Lahore, Punjab, Pakistan;92-42-5864062",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Cybarea Corporation",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "Bahadurabad Rd No. 23, New Karachi Co-Operative Housing Society New Karachi Society PECHS, Karachi, Sindh, Pakistan;null",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Cubix Labs (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.cubix.co",
    "location": "D-23/1, Block 9, Clifton, Karachi, Sindh, Pakistan;021-34534050",
    "CITY": "Karachi",
    "FocusArea": "Cubix is a group of highly talented scientists, mathematicians, engineers motivated by a deep appreciation for building elegant and functional applications that solve complex problems."
  },
  {
    "Name": "Darul Solutions",
    "Rate": "",
    "Employee": "",
    "Founded": "5-Feb-15",
    "Website": "http://www.darulsolutions.com",
    "location": "Westland Trade Centre 4th Floor, Office Suite B-4 , Shaheed-e-Millat Road, Karachi., Karachi, Sindh, Pakistan 75350;(+92 21) 34380545",
    "CITY": "Karachi",
    "FocusArea": "Darul Solutions is an IT Solution company which is specialized in web designing and development, software development, E-Commerce, graphics designing, enterprise solution services, Online Media planning and other IT Solutions, which are the core requirements of today’s business industries around the world."
  },
  {
    "Name": "CRYSTALLITE PAKISTAN (PVT) LTD",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://crystal-lite.net",
    "location": "Suit # 1210-1212, 12th Floor, Caesars Tower, Main Shahah-e-Faisal, Karachi, Karachi, Sindh, Pakistan;tel: 92 021 32803139",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Cure Partners",
    "Rate": "",
    "Employee": "",
    "Founded": "2-Feb-17",
    "Website": "https://www.navetor.com/",
    "location": "1-C/5 awais Chambers Sikander Malhi Road Gulberg, Lahore, Punjab, Pakistan 54000;042-35750363",
    "CITY": "Lahore",
    "FocusArea": "Built from the cloud up, NaVetor veterinary software is a modern, efficient, beautifully easy way to streamline your workday and navigate your business. Its thoughtful, intuitive design allows you to see a quick snapshot of practice activity, maintain complete electronic medical records, manage the health of your business, and save clicks – and time. And because it is cloud-based, you can use it anywhere, without the need for installation or new hardware investments."
  },
  {
    "Name": "Cyber System Private Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.xybersystem.com/",
    "location": "3-Fane Road Lahore., Lahore, Punjab, Pakistan;tel: 92-42-37231723, 92-42-37231724",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Demo Enterprises Pvt Ltd",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.demo.org.pk",
    "location": "192 Street 32, Islamabad, Islamabad Capital Territory, Pakistan;tel: 0334-5335881",
    "CITY": "Islamabad",
    "FocusArea": "We provide consultancy, trainings, services, and research in impact-driven verticals such as innovation, entrepreneurship, skills development, technology and communications."
  },
  {
    "Name": "DataNet",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.info@wol.net.pk",
    "location": "III-C, Jami Commerical St. #11, Karachi, Sindh, Pakistan;(9221) 5388425-9",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Decojent",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.decojent.com",
    "location": "Office #404-405, Rim Jhim Mall, Gulshan-e-Iqbal Block 6, Karachi, Sindh, Pakistan;021-34960281",
    "CITY": "Karachi",
    "FocusArea": "We are product design company located in Karachi, Pakistan. Our team love to design challenging digital products. We help discover untapped valuable insights to turn complex applications into simple relatable experiences for both consumer and enterprise applications"
  },
  {
    "Name": "Data Focal Systems Pvt. Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.datafocal.com",
    "location": "35-A, Street 27, Islamabad, Islamabad Capital Territory, Pakistan;(92-51) 2211254, 2211395",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "Csoft (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.csoft-sys.com",
    "location": "18-E/III, Model Town , Lahore, Punjab, Pakistan;(9242) 5863960",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "CyberVision International",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.cybervision.com.pk",
    "location": "Plot 18,19, 1st Floor, Paradise Plaza, Sector E-11/2, Islamabad, Islamabad Capital Territory, Pakistan;051 230 4878, 051 230 4863",
    "CITY": "Islamabad",
    "FocusArea": "Since commencing our journey in 2002, we have been striving for excellence in our competencies and processes. We believe the path towards success lies in responding to evolving market needs, a customer centric approach and embracing best practices."
  },
  {
    "Name": "Cult Productions (Pvt.) Ltd",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.cultproductions.com.pk",
    "location": "78-C, Second Floor, Main Khayaban-e-Jami, Phase VII, DHA, Karachi, Sindh, Pakistan;tel: 021 35395434-6",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "DIGINC (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.diginc.io",
    "location": "325 Street 32, Islamabad, Islamabad Capital Territory, Pakistan;0333-7777008",
    "CITY": "Islamabad",
    "FocusArea": "Diginc is a leading technology solutions providing firm that specializes in deep analytics, cost effective and data driven strategies and solutions for our clients. Diginc aims to cover all bases and resolve technical hitches a business may encounter by providing a complete 360° array of technical solutions.Improved Financial Well-beingOur solutions support investors to build a successful, stable & international solution eliminating costs while increasing"
  },
  {
    "Name": "Dice Analytics (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.diceanalytics.pk",
    "location": "1 Faiz Ahmed Faiz Road, Islamabad, Islamabad Capital Territory, Pakistan;051-8356066",
    "CITY": "Islamabad",
    "FocusArea": "We provide consultancy services in the domain of Big Data, Data Science and Business Intelligence. We provide corporate and individual level trainings in domains of Big Data, Data Science, Business Intelligence and Data Warehouse. We offer skilled resources specialised Big Data, Data Science, Business Intelligence and Data Warehouse."
  },
  {
    "Name": "Dockland Technologies Pakistan Private Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.docklandtechnologies.com",
    "location": "98 Al Hamra C.H.S. Block-7/8, Off Tipu Sultan Road, Karachi, Sindh, Pakistan;021 34522798",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "DMM NOW (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.dmmnow.com",
    "location": "Unnamed Road, Islamabad, Islamabad Capital Territory, Pakistan;051-5424011",
    "CITY": "Islamabad",
    "FocusArea": "We examine what MNOs are doing to stay relevant and competitive in this fast-paced world, and which ones are doing it best. We then strategize using smart tools and global resources in order to understand the implications of every choice our clients"
  },
  {
    "Name": "Digitech Global (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://hospitall.tech",
    "location": "Netsol Avenue, Lahore, Punjab, Pakistan;0321-4496814",
    "CITY": "Lahore",
    "FocusArea": "Proudly serving the world’s top asset finance and leasing companies with smart software technology for over four decades. Changing the game in the healthcare industry, HospitALL makes healthcare more accessible and efficient for general consumers. Our aim is to not only benefit the consumers but each and every stakeholder; Medical Care Providers, Professionals and Healthcare Consumers. The long term goal is not just to create systems but to make them robust and sustainable as well in order"
  },
  {
    "Name": "Digital Broadcast Private Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.dbtv.live",
    "location": "Service Road, Islamabad, Islamabad Capital Territory, Pakistan;3333833330",
    "CITY": "Islamabad",
    "FocusArea": "Digital Broadcast Pvt. Limited (DBTV) is the first Internet TV in the South-Asian region. DBTV aims to disrupt the media landscape in the region with the mission of empowering citizens with information that can be translated into actionable knowledge. DBTV is also one of the first media entities in the region to deploy Artificial Intelligence (AI) enabled newsroom. DBTV core values are Empathy and Compassion, which translate into building Trust in societies. DBTV content aims to reflect and insp"
  },
  {
    "Name": "DevBatch Pvt Ltd",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.devbatch.com",
    "location": "3rd floor, 23-A, Ali Block, Garden Town, Lahore, Punjab, Pakistan;0333 6155541",
    "CITY": "Lahore",
    "FocusArea": "Award-Winning, US-Based Team of Tech Gurus; DevBatch began its journey over a decade ago. Started as a one-man endeavor, we have now expanded into a multinational software development company with a globalized clientele. We use our technological and creative genius to design and develop simple yet splendid digital experiences, across all platforms. Custom mobile and web development, enterprise mobility solutions, game development and digital marketing services we offer all these servi"
  },
  {
    "Name": "Digitalsofts (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.digitalsofts.com",
    "location": "Office#1, 2nd Floor, 3rd Galleria, Rex City, Faisalabad, Punjab, Pakistan;0321 8661765",
    "CITY": "",
    "FocusArea": "Digitalsofts (Software Company) is affiliated and member of the Chambers and IT Associations like P@SHA,FCCI, government related departments PSEB, TDAP. and our company is a permanent tax paying company which is registered with SECP & FCCI Faisalabad chamber of commerce and Industry."
  },
  {
    "Name": "Descon Information Systems",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.desconinfosys.com",
    "location": "38 Davis Road, Lahore, Punjab, Pakistan;(9242) 636.5134",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Dikhawa",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.dikhawa.pk",
    "location": "plot 729/c/2, 4th floor, block-2,PECHS Karachi, Karachi, Sindh, Pakistan;9.23E+11",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Diyatech Pakistan",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.diyatech.com",
    "location": "Plot No. 43, Street No. 36, Sector G-10/4, Islamabad, Islamabad Capital Territory, Pakistan;0300-8551888",
    "CITY": "Islamabad",
    "FocusArea": "Diyatech is solutions focused company, committed to delivering creative and challenging software solutions. Our goal is to build positive relationships, add value, and provide highest quality of work to our customers in order to lead in providing technology solutions and web development services, all at very affordable cost. We endeavor to create a congenial and growth oriented environment for our employees, where there is plenty of challenge to stimulate their intellect while work environment i"
  },
  {
    "Name": "DG Harbour PVT LTD",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.dgharbour.com",
    "location": "48M, Block 6, PECHS, Karachi, Sindh, Pakistan;34302260/1",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "DevSpot (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "https://devspot.pk/",
    "location": "E93 Street, Rawalpindi, Punjab, Pakistan;0300 5559833",
    "CITY": "Rawalpimdi",
    "FocusArea": "Cover the entire range of internet marketing, from SEO and content marketing to building cloud applications and versatile applications. We realize your vision, and along the way share with you valuable insights about online marketing."
  },
  {
    "Name": "Digital Research Labs (Pvt) Ltd",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.drl.com.pk",
    "location": "Office # 20, Street #2, Sector E-11/4, Islamabad, Islamabad, Islamabad Capital Territory, Pakistan;(9251) 2877575, 2803191",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "DPL (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": "1-Dec-03",
    "Website": "http://www.dplit.com",
    "location": "Islamabad Stock Exchange Tower, 14th Floor، Jinnah Ave, F 7/1 Blue Area, Islamabad, Islamabad Capital Territory 44000, Islamabad, Islamabad Capital Territory, Pakistan 46000;(051) 2895321",
    "CITY": "Islamabad",
    "FocusArea": "DPL’s culture aims to unlock human potential, raising people above a subservient and robotic “Yes Sir!” mentality. With a liberating culture and a healthy environment, we are able to attract the top 5% talent in the market. Our employees are encouraged to question, reflect and improvise which along with their experiences and insights, leads to creative solutions that outsmart the competition."
  },
  {
    "Name": "Digital Processing Systems Inc.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.d-p-s.com",
    "location": "1st floor, Software Technology Park , Islamabad, Islamabad Capital Territory, Pakistan;(9251) 2826630",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "Discretelogix Pvt. Limited",
    "Rate": "",
    "Employee": "",
    "Founded": "10-Apr-06",
    "Website": "https://www.discretelogix.com/",
    "location": "Service Road North, Islamabad, Islamabad Capital Territory, Pakistan 46000;#ERROR!",
    "CITY": "Islamabad",
    "FocusArea": "Established in 2006, Discretelogix is an ISO 9001:2008 certified technology-oriented solution provider company serving clients worldwide."
  },
  {
    "Name": "Devaj Technology",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.devaj.co",
    "location": "M. T. Khan Road, Karachi, Sindh, Pakistan;021-3561-0429",
    "CITY": "Karachi",
    "FocusArea": "Devaj Technology (DT) develops cloud based solutions using emerging & disruptive technologies for Enterprise & Industrial markets.We have under one roof the capabilities to design our electronics & mechanical components & integrate them with complex user friendly web enabled softwares. Our product development capabilities span the complete cycle from inspiration to production. DT has strategically recruited an A-Team of top tech experts having revolutionary minds who are working"
  },
  {
    "Name": "DGS Private Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "Arcadia Building Plot 119 Street 16 DHA PHase 1 Main Korangi Road, Karachi, Sindh, Pakistan;null",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "E-Ocean (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.eocean.com.pk",
    "location": "Mezzanine Floor,29-c, sunset lane #1, Phase II, Ext. DHA, Karachi, Karachi, Sindh, Pakistan;tel: 35317900-01",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "eDev Technologies",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.edevtech.com",
    "location": "502-3, Progressive Square, 11-A, Block-6, Karachi, Sindh, Pakistan;(9221) 4314571-73",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "E2E Solution Providers (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.e2esp.com",
    "location": "146/I, Shalimar Lane, Lahore, Punjab, Pakistan;-6603292",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "DynaSoft Technologies",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://dynasoft.tech/",
    "location": "Service Road, Islamabad, Islamabad Capital Territory, Pakistan;0301-5157558",
    "CITY": "Islamabad",
    "FocusArea": "DynaSoft is driven by the passion to use technology for continuously improving business processes with a goal of increasing profitability. We empower organizations to gain the dividends of the possibilities that technology offers. DynaSoft aspires to be the market leaders in CRM and ERP Implementation services in the EMEA region. As a team, we have a cumulative experience of 2 decades delivering world class enterprise software solutions for our clients. We have successfully delivered numerous p"
  },
  {
    "Name": "E-Cart Services Pakistan Pvt. Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.kaymu.pk",
    "location": "2A 2nd Floor, Dolmen Executive Tower, Clifton, Karachi, Karachi, Sindh, Pakistan;tel: 021-35297851-56",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "EC-Pak (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "214, The Plaza, Block-9, Karachi, Sindh, Pakistan;(021) 582-2641-42",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "DSS Media",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.dssmedia.com",
    "location": "46 GG, Phase IV, DHA Lahore, Lahore, Punjab, Pakistan;tel: +92 423 5694380",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Dtech Systems",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.dtechsystems.co",
    "location": "50 Lower Mall, Lahore, Punjab, Pakistan;-7110412",
    "CITY": "Lahore",
    "FocusArea": "Dtech Systems is a full service leading digital agency with its clients in the US, UK, and the GCC region. We offer an array of digital media services with a unique flair for expertise. Our digital solutions offer clients complete control over their business. There is a wide range of services we offer including website design & development, mobile app development, content and inbound marketing, search engine optimization and a wide range of social media services and campaigns to help our cli"
  },
  {
    "Name": "Dr. Tech SMC (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "https://drtechpk.com/",
    "location": "21 Cooper Road, Lahore, Punjab, Pakistan;0321-7079639",
    "CITY": "Lahore",
    "FocusArea": "Dr. Tech is a group of technology enthusiasts with a knack for emerging technologies, implied analytics and flying objects. We offer a range of indigenous products and services to harness the power of innovation with insights derived from the data and offer pioneering turnkey solutions in line with United Nation’s sustainable development agenda to transform our world."
  },
  {
    "Name": "Dzine Media",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.dzine-media.com",
    "location": "90-91, Kohi Noor One, First Floor, Faisalabad, Faisalabad, Punjab, Pakistan;null",
    "CITY": "",
    "FocusArea": null
  },
  {
    "Name": "EdTech Worx (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": "7-Feb-18",
    "Website": "https://edtechworx.com/",
    "location": "National Incubation Center Lahore, Syed Babar Ali School of Science and Engineering, LUMS, D.H.A, Lahore, Pakistan 547892, Lahore, Punjab, Pakistan 46000;-8359332",
    "CITY": "Lahore",
    "FocusArea": "We are an educational technology company that develops online digital interactive data-driven products in the spectrum of Education and Corporate arena."
  },
  {
    "Name": "e-Curesoft (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "House No. 8, Street 15, Cavalry Ground, Lahore, Punjab, Pakistan;(9242) 667-4169",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Ecommerce Gateway Pakistan (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.ecgateway.net",
    "location": "8 Kokan Society, Azhar Hussain Road, Karachi, Sindh, Pakistan;tel: +9221111222444",
    "CITY": "Karachi",
    "FocusArea": "Ecommerce Gateway Pakistan (Pvt) Ltd is an Exhibitions Owner, Trade Fair, Trade Shows Exhibition Organizer, Event Management Company with strategic partners and major operations in Pakistan. Since its inception in 2001, Ecommerce Gateway has, through a two-prong strategy, extended its reach to cover all major cities of Pakistan, simultaneously establishing a network of partners in China, Turkey, South Korea, U.K., Malaysia, U.A.E., Central Asian Republics, Middle East, India and Far East. With r"
  },
  {
    "Name": "DYS Solutions (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.dys-solutions.com",
    "location": "Suit 1012, 10th Floor, Kavish Crown Plaza Karachi, Karachi, Sindh, Pakistan;tel: +922134330999",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "DynamoLogic",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.dynamologic.com",
    "location": "12 Main Double Road, Islamabad, Islamabad Capital Territory, Pakistan;051-8312580",
    "CITY": "Islamabad",
    "FocusArea": "A Technology & Business Partner you can bank on! Our experience comes from flawless execution of hundreds of projects"
  },
  {
    "Name": "Dynamic Global Links",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.dglinks.net",
    "location": "1613-1615, 16th Floor, Muhammadi Trade Tower, Altaf Hussain Road, Off I I Chundrigar Road, Karachi, Sindh, Pakistan;021-32371121-25",
    "CITY": "Karachi",
    "FocusArea": "Dynamics Global links is a business-focused technology solutions company that enables organizations to create demonstrable business value through the use of technology. By assisting the enterprise to develop and execute on focused strategies to reduce operating costs or drive critical competitive advantage, we ensure your business will obtain the desired benefit from your technology investments or can exit a project quickly with little risk."
  },
  {
    "Name": "Ebryx Private Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.ebryx.com",
    "location": "Office #2, 1st Floor, Big City Plaza, 3-E-2, Main Boulevard, Gulberg III, Lahore, Punjab, Pakistan;042-3577-4061",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "ECASoft",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.ecasoft.com",
    "location": "194, Block-7/8, Opposite Hill Park, Karachi, Sindh, Pakistan;(9221) 4387936",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "EDP Services (Pvt) Limited",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.edp.com.pk",
    "location": "No. 414, 4th floor, Ennum Estate , Karachi, Sindh, Pakistan;(9221) 453-8918",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Dymaxel Systems (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.dymaxel.com",
    "location": "Shahrah-e-Faisal Road, Karachi, Sindh, Pakistan;92-21-38887829",
    "CITY": "Karachi",
    "FocusArea": "We help our Clients towards Digital Transformation by reinventing their organization through the use of digital technology to improve the way it performs and serves its constituents."
  },
  {
    "Name": "Ensign Communique (Pvt) Ltd",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.ensigncommunique.com",
    "location": "6th Floor, Shaheen Complex, Karachi, Sindh, Pakistan;#ERROR!",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Engineering Consultants International",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.ecil.com",
    "location": "45/1 Darul Aman Street 4, Karachi, Sindh, Pakistan;(9221) 4542290-4",
    "CITY": "Karachi",
    "FocusArea": "We are committed to provide service to our clients as “service business”."
  },
  {
    "Name": "Enterprise Team",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.eTeamID.com",
    "location": "607, Level 6, Ibrahim Trade Towers, Main Shahrah-e-Faisal, Karachi, Sindh, Pakistan;#ERROR!",
    "CITY": "Karachi",
    "FocusArea": "Enterprise Team (eTeam) is a software development company offering a wide range of services and products in the areas of web applications, websites, interactive media, Android and iOS development."
  },
  {
    "Name": "ePatterns",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "188-R, Block-2, Karachi, Sindh, Pakistan;021-4531345",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Empower Pakistan (Pvt) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://empowerpk.org",
    "location": "146 Murree Road, Rawalpindi, Punjab, Pakistan;tel: +92-51-5130397, +92-51-8313528",
    "CITY": "Rawalpimdi",
    "FocusArea": "Here at Genetech we pride ourselves with our ‘open communication’ approach with our clientele. Once you initiate a project with us, be it big or small, our team will provide regular updates, regarding project status. We encourage our clients to interact with us as much as possible; so that we can deliver exactly you’re looking for. As a team, we put in a lot of dedication and finesse into everything we create with you, so that you’re thoroughly pleased with the outcome."
  },
  {
    "Name": "Efrotech Services",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.efrotech.com",
    "location": "12-C, Block 6, P.E.C.H.S, Shahrah-e-Faisal, Karachi, Sindh, Pakistan;(92-21) 34556101-03, 32043020-21",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "EduSys Pakistan",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.edusyspk.com",
    "location": "32 Multan Road near Green Building, Lahore, Punjab, Pakistan;042-37411816",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Electro Business",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.ebtechno.com/",
    "location": "Khayaban-e-Seher, Karachi, Sindh, Pakistan;0311-1237111",
    "CITY": "Karachi",
    "FocusArea": "Electro business Technologies is a quality driven companyand is one of the leading Web Services providers in their Since 2000."
  },
  {
    "Name": "Engineering Systems (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.eaworld.com",
    "location": "AL-9, 15th Lane, Khayaban-e-Hilal, Karachi, Sindh, Pakistan;(9221) 5849117; 5841821-24; 5841638-39",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "eMumba (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.emumba.com",
    "location": "3 Service Road North, Islamabad, Islamabad Capital Territory, Pakistan;null",
    "CITY": "Islamabad",
    "FocusArea": "Emumba is a cutting-edge software technology firm that prides itself in its ability to attract and retain top talent and solve complex problems. Led by Silicon Valley veterans, the leadership team has 75+ years of cumulative global experience in technology development, product design and leadership."
  },
  {
    "Name": "Enabling Technologies.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.wiredet.com",
    "location": "172/P, Najeeb Corner, 4th Floor, Block-2, P.E.C.H.S, Karachi, Sindh, Pakistan;(92) 300-8220180",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Elixir Technologies Pakistan (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": "1-Feb-85",
    "Website": "http://www.elixir.com",
    "location": "5th Floor, Telecom Foundation Complex 7-Mauve Area,Sector G-9/4., Islamabad, Islamabad Capital Territory, Pakistan 46000;(9251) 2808261 (66)",
    "CITY": "Islamabad",
    "FocusArea": "Elixir Technologies provides technology and services that help organizations improve communications to their members and customers by streamlining processes and reducing operational costs."
  },
  {
    "Name": "ENMAC Technologies (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.enmac.com.hk",
    "location": "15FF, Central Plaza, Barkat Market, Lahore, Punjab, Pakistan;#ERROR!",
    "CITY": "Lahore",
    "FocusArea": null
  },
  {
    "Name": "Elikser Consultancy Private Limited",
    "Rate": "",
    "Employee": "",
    "Founded": "18-Feb-16",
    "Website": "http://www.elikser.com",
    "location": "10 Sachal Sarmast Road, Islamabad, Islamabad Capital Territory, Pakistan 546000;051-8441453",
    "CITY": "Islamabad",
    "FocusArea": "Elikser is a service-oriented consultancy and advisory services organization with delivery offices in North America and Pakistan. By leveraging latest technologies and maintaining international standards, Elikser partners with its clients to help them gain unequivocal efficiencies through processes optimization and technology deployment."
  },
  {
    "Name": "Engro Digital Ltd",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "http://www.engro.com",
    "location": "Sea View Road, Karachi, Sindh, Pakistan;-463",
    "CITY": "Karachi",
    "FocusArea": "Engro’s portfolio consists of varied businesses, which include fertilizers, foods, chemical storage & handling, trading, energy and petrochemicals. Fuelled by the vision of becoming the premier Pakistani enterprise with a global reach, passionately pursuing value creation for all stakeholders Engro’s investments in agriculture, foods, energy and chemicals are all designed to deploy inclusive business models to pursue an integrated and inclusive growth for all who interact with our businesses"
  },
  {
    "Name": "ePlanet Communications (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": null,
    "location": "12th Floor, Caesar's Tower, Karachi, Sindh, Pakistan;(92-21) 2791949, 2791951-54",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Emmaculate",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.emmaculate.com",
    "location": "507, Progressive Center, Karachi, Sindh, Pakistan;(9221) 4559612-13",
    "CITY": "Karachi",
    "FocusArea": null
  },
  {
    "Name": "Electronic Solutions Pakistan (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.esolpk.com",
    "location": "12-D, SNC Centre, Islamabad, Islamabad Capital Territory, Pakistan;92-51-2870640-2",
    "CITY": "Islamabad",
    "FocusArea": null
  },
  {
    "Name": "Enablers (Pvt.) Ltd.",
    "Rate": "",
    "Employee": "",
    "Founded": "1-Feb-15",
    "Website": "http://www.enablersinc.com",
    "location": "Plot # 96 , I & T Center, Street 31, G-9/1, Islamabad, Islamabad, Islamabad Capital Territory, Pakistan 46000;92518435117",
    "CITY": "Islamabad",
    "FocusArea": "Enablers Inc. is an advance technology provider, delivering enhanced solutions to leading communications providers. Our professional teams collaboratively work to provide high customer satisfaction and premium web-based solutions."
  },
  {
    "Name": "Emergen Consulting",
    "Rate": "",
    "Employee": "",
    "Founded": null,
    "Website": "www.emergen.biz",
    "location": "F-8/1 Hatim Alvi Rd, Karachi, Sindh, Pakistan;(021.529.0381",
    "CITY": "Karachi",
    "FocusArea": null
  }
]